STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/**
  **********************************************************************************************************************
  * @file    stm32u5xx_ll_gfxtim.h
  * @brief   Header file of GFXTIM LL module.
  **********************************************************************************************************************
    * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32U5XX_LL_GFXTIM_H
#define STM32U5XX_LL_GFXTIM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32u5xx.h"

/** @addtogroup STM32U5xx_LL_Driver
  * @{
  */

#if defined (GFXTIM)

/** @defgroup GFXTIM_LL GFXTIM
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup GFXTIM_LL_Exported_Constants GFXTIM Exported Constants
  * @{
  */

/** @defgroup GFXTIM_LL_EC_TEARING_EFFECT_SOURCE GFXTIM Tearing-effect source
  * @{
  */
#define LL_GFXTIM_TEARING_EFFECT_GPIO   0x0U            /*!< Input pad rising  */
#define LL_GFXTIM_TEARING_EFFECT_HSYNC  GFXTIM_CR_TES_1 /*!< HSYNC rising      */
#define LL_GFXTIM_TEARING_EFFECT_VSYNC  GFXTIM_CR_TES   /*!< VSYNC rising      */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_TEARING_EFFECT_POLARITY GFXTIM Tearing-effect polarity
  * @{
  */
#define LL_GFXTIM_TEARING_EFFECT_RISING_EDGE  0U               /*!< Tearing Effect active on rizing edge  */
#define LL_GFXTIM_TEARING_EFFECT_FALLING_EDGE GFXTIM_CR_TEPOL  /*!< Tearing Effect active on falling edge */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_LINE_CLOCK_SOURCE GFXTIM Line clock source
  * @{
  */
#define LL_GFXTIM_CLKGEN_LINE_LCNT_UNDERFLOW   0U                                                           /*!< Line Clock Counter underflow  */
#define LL_GFXTIM_CLKGEN_LINE_FCNT_UNDERFLOW   GFXTIM_CGCR_LCS_0                                            /*!< Frame Clock Counter underflow */
#define LL_GFXTIM_CLKGEN_LINE_HSYNC_RISING     GFXTIM_CGCR_LCS_1                                            /*!< HSYNC rising edge             */
#define LL_GFXTIM_CLKGEN_LINE_HSYNC_FALLING    (GFXTIM_CGCR_LCS_0 | GFXTIM_CGCR_LCS_1)                      /*!< HSYNC falling edge            */
#define LL_GFXTIM_CLKGEN_LINE_VSYNC_RISING     GFXTIM_CGCR_LCS_2                                            /*!< VSYNC rising edge             */
#define LL_GFXTIM_CLKGEN_LINE_VSYNC_FALLING    (GFXTIM_CGCR_LCS_2 | GFXTIM_CGCR_LCS_0)                      /*!< VSYNC falling edge            */
#define LL_GFXTIM_CLKGEN_LINE_TE_RISING        (GFXTIM_CGCR_LCS_2 | GFXTIM_CGCR_LCS_1)                      /*!< TE rising edge                */
#define LL_GFXTIM_CLKGEN_LINE_TE_FALLING       (GFXTIM_CGCR_LCS_2 | GFXTIM_CGCR_LCS_1 | GFXTIM_CGCR_LCS_0)  /*!< TE falling edge               */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_LINE_CLOCK_COUNTER_CLOCK_SOURCE GFXTIM Line clock counter clock source
  * @{
  */
#define LL_GFXTIM_CLKGEN_LINE_COUNT_NONE        0U                 /*!< Disable line clock counter        */
#define LL_GFXTIM_CLKGEN_LINE_COUNT_GFXTIMHCLK  GFXTIM_CGCR_LCCCS  /*!< hclk as line clock counter source */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_CLOCK_COUNTER_FORCE_RELOAD GFXTIM  Counter clock generator force reload
  * @{
  */
#define LL_GFXTIM_LINE_FORCE_RELOAD       GFXTIM_CGCR_LCCFR                       /*!< Line clock counter force reload           */
#define LL_GFXTIM_FRAME_FORCE_RELOAD      GFXTIM_CGCR_FCCFR                       /*!< Frame clock counter force reload          */
#define LL_GFXTIM_LINE_FRAME_FORCE_RELOAD (GFXTIM_CGCR_LCCFR | GFXTIM_CGCR_FCCFR) /*!< Line and frame clock counter force reload */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_LINE_CLOCK_COUNTER_HW_REALOD GFXTIM Line clock counter hardware reload
  * @{
  */
#define LL_GFXTIM_CLKGEN_LCNT_NO_RELOAD               0U                                                                   /*!< No hardware reload */
#define LL_GFXTIM_CLKGEN_LCNT_FRAME_UNDERFLOW_RELOAD  GFXTIM_CGCR_LCCHRS_0                                                 /*!< FCC underflow      */
#define LL_GFXTIM_CLKGEN_LCNT_HSYNC_RISING_RELOAD     GFXTIM_CGCR_LCCHRS_1                                                 /*!< HSYNC rising       */
#define LL_GFXTIM_CLKGEN_LCNT_HSYNC_FALLING_RELOAD    (GFXTIM_CGCR_LCCHRS_0 | GFXTIM_CGCR_LCCHRS_1)                        /*!< HSYNC falling      */
#define LL_GFXTIM_CLKGEN_LCNT_VSYNC_RISING_RELOAD     GFXTIM_CGCR_LCCHRS_2                                                 /*!< VSYNC rising       */
#define LL_GFXTIM_CLKGEN_LCNT_VSYNC_FALLING_RELOAD    (GFXTIM_CGCR_LCCHRS_2 | GFXTIM_CGCR_LCCHRS_0)                        /*!< VSYNC falling      */
#define LL_GFXTIM_CLKGEN_LCNT_TE_RISING_RELOAD        (GFXTIM_CGCR_LCCHRS_2 | GFXTIM_CGCR_LCCHRS_1)                        /*!< TE rising          */
#define LL_GFXTIM_CLKGEN_LCNT_TE_FALLING_RELOAD       (GFXTIM_CGCR_LCCHRS_2 | GFXTIM_CGCR_LCCHRS_1 | GFXTIM_CGCR_LCCHRS_0) /*!< TE falling         */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_FRAME_CLOCK_SOURCE GFXTIM Frame clock source
  * @{
  */
#define LL_GFXTIM_CLKGEN_FRAME_LCNT_UNDERFLOW   0U                                                          /*!< Line Clock Counter underflow  */
#define LL_GFXTIM_CLKGEN_FRAME_FCNT_UNDERFLOW   GFXTIM_CGCR_FCS_0                                           /*!< Frame Clock Counter underflow */
#define LL_GFXTIM_CLKGEN_FRAME_HSYNC_RISING     GFXTIM_CGCR_FCS_1                                           /*!< HSYNC rising edge             */
#define LL_GFXTIM_CLKGEN_FRAME_HSYNC_FALLING    (GFXTIM_CGCR_FCS_0 | GFXTIM_CGCR_FCS_1)                     /*!< HSYNC falling edge            */
#define LL_GFXTIM_CLKGEN_FRAME_VSYNC_RISING     GFXTIM_CGCR_FCS_2                                           /*!< VSYNC rising edge             */
#define LL_GFXTIM_CLKGEN_FRAME_VSYNC_FALLING    (GFXTIM_CGCR_FCS_2 | GFXTIM_CGCR_FCS_0)                     /*!< VSYNC falling edge            */
#define LL_GFXTIM_CLKGEN_FRAME_TE_RISING        (GFXTIM_CGCR_FCS_2 | GFXTIM_CGCR_FCS_1)                     /*!< TE rising edge                */
#define LL_GFXTIM_CLKGEN_FRAME_TE_FALLING       (GFXTIM_CGCR_FCS_2 | GFXTIM_CGCR_FCS_1 | GFXTIM_CGCR_FCS_0) /*!< TE falling edge               */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_FRAME_CLOCK_COUNTER_CLOCK_SOURCE GFXTIM Frame clock counter clock source
  * @{
  */
#define LL_GFXTIM_CLKGEN_FCNT_DISABLE         0U                                                                /*!< Disable                      */
#define LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW  GFXTIM_CGCR_FCCCS_0                                               /*!< Line Clock Counter underflow */
#define LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING    GFXTIM_CGCR_FCCCS_1                                               /*!< HSYNC rising edge            */
#define LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING   (GFXTIM_CGCR_FCCCS_0 | GFXTIM_CGCR_FCCCS_1)                       /*!< HSYNC falling edge           */
#define LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING    GFXTIM_CGCR_FCCCS_2                                               /*!< VSYNC rising edge            */
#define LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING   (GFXTIM_CGCR_FCCCS_2 | GFXTIM_CGCR_FCCCS_0)                       /*!< VSYNC falling edge           */
#define LL_GFXTIM_CLKGEN_FCNT_TE_RISING       (GFXTIM_CGCR_FCCCS_2 | GFXTIM_CGCR_FCCCS_1)                       /*!< TE rising edge               */
#define LL_GFXTIM_CLKGEN_FCNT_TE_FALLING      (GFXTIM_CGCR_FCCCS_2 | GFXTIM_CGCR_FCCCS_1 | GFXTIM_CGCR_FCCCS_0) /*!< TE falling edge              */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_FRAME_CLOCK_COUNTER_HW_REALOD GFXTIM Frame clock counter hardware reload
  * @{
  */
#define LL_GFXTIM_CLKGEN_FCNT_NO_RELOAD               0U                                                                   /*!< No hardware reload           */
#define LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW_RELOAD   GFXTIM_CGCR_FCCHRS_0                                                 /*!< Line Clock Counter underflow */
#define LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING_RELOAD     GFXTIM_CGCR_FCCHRS_1                                                 /*!< HSYNC rising edge            */
#define LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING_RELOAD    (GFXTIM_CGCR_FCCHRS_0 | GFXTIM_CGCR_FCCHRS_1)                        /*!< HSYNC falling edge           */
#define LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING_RELOAD     GFXTIM_CGCR_FCCHRS_2                                                 /*!< VSYNC rising edge            */
#define LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING_RELOAD    (GFXTIM_CGCR_FCCHRS_2 | GFXTIM_CGCR_FCCHRS_0)                        /*!< VSYNC falling edge           */
#define LL_GFXTIM_CLKGEN_FCNT_TE_RISING_RELOAD        (GFXTIM_CGCR_FCCHRS_2 | GFXTIM_CGCR_FCCHRS_1)                        /*!< TE rising edge               */
#define LL_GFXTIM_CLKGEN_FCNT_TE_FALLING_RELOAD       (GFXTIM_CGCR_FCCHRS_2 | GFXTIM_CGCR_FCCHRS_1 | GFXTIM_CGCR_FCCHRS_0) /*!< TE falling edge              */
/**
  * @}
  */

