STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/** @defgroup GFXTIM_LL_EC_ABSTIM_LINE_COMPARE GFXTIM Absolute line compare
  * @{
  */
#define LL_GFXTIM_ABSTIM_LINE_COMP_1  0U   /*!< Absolute line compare 1 */
#define LL_GFXTIM_ABSTIM_LINE_COMP_2  4U   /*!< Absolute line compare 2 */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_ABSOLUTE_TIMER_COUNTER GFXTIM Absolute timer counter
  * @{
  */
#define LL_GFXTIM_ABSTIM_LINE_COUNTER        GFXTIM_TCR_ALCEN                      /*!< Enable absolute line counter                 */
#define LL_GFXTIM_ABSTIM_FRAME_COUNTER       GFXTIM_TCR_AFCEN                      /*!< Enable absolute frame counter                */
#define LL_GFXTIM_ABSTIM_LINE_FRAME_COUNTER  (GFXTIM_TCR_ALCEN | GFXTIM_TCR_AFCEN) /*!< Enable absolute line absolute frame counters */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_ABSOLUTE_COUNTER_RESET GFXTIM Absolute counter reset
  * @{
  */
#define LL_GFXTIM_ABSTIM_LINE_COUNTER_RESET        GFXTIM_TCR_FALCR                      /*!< Force absolute line counter reset            */
#define LL_GFXTIM_ABSTIM_FRAME_COUNTER_RESET       GFXTIM_TCR_FAFCR                      /*!< Force absolute frame counter reset           */
#define LL_GFXTIM_ABSTIM_LINE_FRAME_COUNTER_RESET  (GFXTIM_TCR_FALCR | GFXTIM_TCR_FAFCR) /*!< Force absolute line and frame counters reset */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_RELTIM_FRAME_COUNTER GFXTIM Relative frame counter(s)
  * @{
  */
#define LL_GFXTIM_RELTIM_COUNTER_1    GFXTIM_TCR_RFC1EN                        /*!< Relative frame counter 1    */
#define LL_GFXTIM_RELTIM_COUNTER_2    GFXTIM_TCR_RFC2EN                        /*!< Relative frame counter 2    */
#define LL_GFXTIM_RELTIM_COUNTER_ALL  (GFXTIM_TCR_RFC1EN | GFXTIM_TCR_RFC2EN)  /*!< All Relative frame counters */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_RELTIM_FRAME_COUNTER_MODE GFXTIM Relative frame counter mode
  * @{
  */
#define LL_GFXTIM_RELTIM_COUNTER_ONESHOT         0U                       /*!< Relative frame counter in one shot mode     */
#define LL_GFXTIM_RELTIM_COUNTER_CONTINUOUS      1U                       /*!< Relative frame counter in continuous mode   */
#define LL_GFXTIM_RELTIM_COUNTER_1_CONTINUOUS    GFXTIM_TCR_RFC1CM        /*!< Relative frame counter 1 in continuous mode */
#define LL_GFXTIM_RELTIM_COUNTER_2_CONTINUOUS    GFXTIM_TCR_RFC2CM        /*!< Relative frame counter 2 in continuous mode */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_RELTIM_FRAME_COUNTER_FORCE_RELOAD GFXTIM Relative frame counter(s) force reload
  * @{
  */
#define LL_GFXTIM_RELTIM_COUNTER_1_FORCE_RELOAD    GFXTIM_TCR_FRFC1R                       /*!< Relative frame counter 1 force reload    */
#define LL_GFXTIM_RELTIM_COUNTER_2_FORCE_RELOAD    GFXTIM_TCR_FRFC2R                       /*!< Relative frame counter 2 force reload    */
#define LL_GFXTIM_RELTIM_COUNTER_ALL_FORCE_RELOAD  (GFXTIM_TCR_FRFC1R | GFXTIM_TCR_FRFC2R) /*!< Relative frame aLL counters force reload */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_EVENTGEN GFXTIM Event generator
  * @{
  */
#define LL_GFXTIM_EVENTGEN_EVENT_1     GFXTIM_EVCR_EV1EN                         /*!< Event generator 1    */
#define LL_GFXTIM_EVENTGEN_EVENT_2     GFXTIM_EVCR_EV2EN                         /*!< Event generator 2    */
#define LL_GFXTIM_EVENTGEN_EVENT_3     GFXTIM_EVCR_EV3EN                         /*!< Event generator 3    */
#define LL_GFXTIM_EVENTGEN_EVENT_4     GFXTIM_EVCR_EV4EN                         /*!< Event generator 4    */
#define LL_GFXTIM_EVENTGEN_EVENT_ALL   (GFXTIM_EVCR_EV1EN | GFXTIM_EVCR_EV2EN | \
                                        GFXTIM_EVCR_EV3EN | GFXTIM_EVCR_EV4EN)   /*!< All event generators */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_EVENTGEN_LINE GFXTIM Line event generator
  * @{
  */
#define LL_GFXTIM_EVENTGEN_LINE_NONE          0U                                        /*!< Line none                       */
#define LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW  GFXTIM_EVSR_LES1_0                        /*!< Absolute line counter overflow  */
#define LL_GFXTIM_EVENTGEN_TEARING_EFFECT     GFXTIM_EVSR_LES1_1                        /*!< Tearing effect                  */
#define LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP    GFXTIM_EVSR_LES1_2                        /*!< Absolute line counter 1 compare */
#define LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP    (GFXTIM_EVSR_LES1_0 | GFXTIM_EVSR_LES1_2) /*!< Absolute line counter 2 compare */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_EVENTGEN_FRAME GFXTIM Frame event generator
  * @{
  */
#define LL_GFXTIM_EVENTGEN_FRAME_NONE         0U                                        /*!< Frame none                      */
#define LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW  GFXTIM_EVSR_FES1_0                        /*!< Absolute frame counter overflow */
#define LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP      GFXTIM_EVSR_FES1_1                        /*!< Absolute frame counter compare  */
#define LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD  GFXTIM_EVSR_FES1_2                        /*!< Relative frame counter 1 reload */
#define LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD  (GFXTIM_EVSR_FES1_0 | GFXTIM_EVSR_FES1_2) /*!< Relative frame counter 1 reload */
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_WATCHDOG_TIMER_CLOCK_SOURCE GFXTIM Watchdog timer clock source
  * @{
  */
#define LL_GFXTIM_WDG_CLK_LINE_CLK        0U                                                                       /*!< Watchdog Line Clock                  */
#define LL_GFXTIM_WDG_CLK_FRAME_CLK       GFXTIM_WDGTCR_WDGCS_0                                                    /*!< Watchdog Frame Clock                 */
#define LL_GFXTIM_WDG_CLK_HSYNC_RISING    GFXTIM_WDGTCR_WDGCS_1                                                    /*!< Watchdog HSYNC rising edge           */
#define LL_GFXTIM_WDG_CLK_HSYNC_FALLING   (GFXTIM_WDGTCR_WDGCS_0 | GFXTIM_WDGTCR_WDGCS_1)                          /*!< Watchdog HSYNC falling edge          */
#define LL_GFXTIM_WDG_CLK_VSYNC_RISING    GFXTIM_WDGTCR_WDGCS_2                                                    /*!< Watchdog VSYNC rising edge           */
#define LL_GFXTIM_WDG_CLK_VSYNC_FALLING   (GFXTIM_WDGTCR_WDGCS_0 | GFXTIM_WDGTCR_WDGCS_2)                          /*!< Watchdog VSYNC falling edge          */
#define LL_GFXTIM_WDG_CLK_TE_RISING       (GFXTIM_WDGTCR_WDGCS_1 | GFXTIM_WDGTCR_WDGCS_2)                          /*!< Watchdog Tearing Effect rising edge  */
#define LL_GFXTIM_WDG_CLK_TE_FALLING      (GFXTIM_WDGTCR_WDGCS_0 | GFXTIM_WDGTCR_WDGCS_1 | GFXTIM_WDGTCR_WDGCS_2)  /*!< Watchdog Tearing Effect falling edge */
#define LL_GFXTIM_WDG_CLK_EVENT_1         GFXTIM_WDGTCR_WDGCS_3                                                    /*!< Watchdog Event Generator 1 output    */
#define LL_GFXTIM_WDG_CLK_EVENT_2         (GFXTIM_WDGTCR_WDGCS_0 | GFXTIM_WDGTCR_WDGCS_3)                          /*!< Watchdog Event Generator 2 output    */
#define LL_GFXTIM_WDG_CLK_EVENT_3         (GFXTIM_WDGTCR_WDGCS_1 | GFXTIM_WDGTCR_WDGCS_3)                          /*!< Watchdog Event Generator 3 output    */
#define LL_GFXTIM_WDG_CLK_EVENT_4         (GFXTIM_WDGTCR_WDGCS_0 | GFXTIM_WDGTCR_WDGCS_1 | GFXTIM_WDGTCR_WDGCS_3)  /*!< Watchdog Event Generator 4 output    */
/**
  * @}
  */

