STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/** @defgroup GFXTIM_LL_EC_FLAG GFXTIM flags
  * @{
  */
#define LL_GFXTIM_FLAG_AFCO      GFXTIM_ISR_AFCOF     /*!< Absolute Frame Counter Overflow Flag  */
#define LL_GFXTIM_FLAG_ALCO      GFXTIM_ISR_ALCOF     /*!< Absolute Line Counter Overflow Flag   */
#define LL_GFXTIM_FLAG_TE        GFXTIM_ISR_TEF       /*!< Tearing Effect Flag                   */
#define LL_GFXTIM_FLAG_AFCC1     GFXTIM_ISR_AFCC1F    /*!< Absolute Frame Counter Compare 1 Flag */
#define LL_GFXTIM_FLAG_ALCC1     GFXTIM_ISR_ALCC1F    /*!< Absolute Line Counter Compare 1 Flag  */
#define LL_GFXTIM_FLAG_ALCC2     GFXTIM_ISR_ALCC2F    /*!< Absolute Line Counter Compare 2 Flag  */
#define LL_GFXTIM_FLAG_RFC1R     GFXTIM_ISR_RFC1RF    /*!< Relative Frame Counter 1 Reload Flag  */
#define LL_GFXTIM_FLAG_RFC2R     GFXTIM_ISR_RFC2RF    /*!< Relative Frame Counter 2 Reload Flag  */
#define LL_GFXTIM_FLAG_EV1       GFXTIM_ISR_EV1F      /*!< Event 1 Flag                          */
#define LL_GFXTIM_FLAG_EV2       GFXTIM_ISR_EV2F      /*!< Event 2 Flag                          */
#define LL_GFXTIM_FLAG_EV3       GFXTIM_ISR_EV3F      /*!< Event 3 Flag                          */
#define LL_GFXTIM_FLAG_EV4       GFXTIM_ISR_EV4F      /*!< Event 4 Flag                          */
#define LL_GFXTIM_FLAG_WDGA      GFXTIM_ISR_WDGAF     /*!< Watchdog Alarm Flag                   */
#define LL_GFXTIM_FLAG_WDGP      GFXTIM_ISR_WDGPF     /*!< Watchdog Pre-alarm Flag               */
#define LL_GFXTIM_FLAG_ALL       (GFXTIM_ISR_AFCOF | GFXTIM_ISR_ALCOF  | GFXTIM_ISR_TEF    | GFXTIM_ISR_AFCC1F | \
                                  GFXTIM_ISR_ALCC1F | GFXTIM_ISR_ALCC2F | GFXTIM_ISR_RFC1RF | GFXTIM_ISR_RFC2RF | \
                                  GFXTIM_ISR_EV1F   | GFXTIM_ISR_EV2F   | GFXTIM_ISR_EV3F   | GFXTIM_ISR_EV4F   | \
                                  GFXTIM_ISR_WDGAF  |  GFXTIM_ISR_WDGPF )
/**
  * @}
  */

/** @defgroup GFXTIM_LL_EC_INTERRUPT GFXTIM Interrupt
  * @{
  */
#define LL_GFXTIM_NONE_IT                         0U                  /*!< No interruptions                                                        */
#define LL_GFXTIM_ABSTIM_FRAME_COUNT_OVERFLOW_IT  GFXTIM_IER_AFCOIE   /*!< Enable absolute frame counter overflow interruption                     */
#define LL_GFXTIM_ABSTIM_LINE_COUNT_OVERFLOW_IT   GFXTIM_IER_ALCOIE   /*!< Enable absolute line counter overflow interruption                      */
#define LL_GFXTIM_TEARING_EFFECT_IT               GFXTIM_IER_TEIE     /*!< Enable tearing-effect interruption                                      */
#define LL_GFXTIM_ABSTIM_FRAME_COMP_IT            GFXTIM_IER_AFCC1IE  /*!< Enable absolute frame counter compare 1 interruption                    */
#define LL_GFXTIM_ABSTIM_LINE_COMP1_IT            GFXTIM_IER_ALCC1IE  /*!< Enable absolute line counter compare 1 interruption                     */
#define LL_GFXTIM_ABSTIM_LINE_COMP2_IT            GFXTIM_IER_ALCC2IE  /*!< Enable absolute line counter compare 2 interruption                     */
#define LL_GFXTIM_ABSTIM_LINE_ALL_IT              (GFXTIM_IER_ALCOIE | GFXTIM_IER_ALCC1IE | \
                                                   GFXTIM_IER_ALCC2IE) /*!< Enable all absolute line counter interruptions                         */

#define LL_GFXTIM_ABSTIM_FRAME_ALL_IT             (GFXTIM_IER_AFCOIE | GFXTIM_IER_AFCC1IE) /*!< Enable all absolute frame interruptions            */

#define LL_GFXTIM_RELTIM_COUNT_1_IT               GFXTIM_IER_RFC1RIE  /*!< Enable relative frame counter 1 interruption                            */
#define LL_GFXTIM_RELTIM_COUNT_2_IT               GFXTIM_IER_RFC2RIE  /*!< Enable relative frame counter 2 interruption                            */
#define LL_GFXTIM_EVENTGEN_EVENT_1_IT             GFXTIM_IER_EV1IE    /*!< Enable event generator 1 interruption                                   */
#define LL_GFXTIM_EVENTGEN_EVENT_2_IT             GFXTIM_IER_EV2IE    /*!< Enable event generator 2 interruption                                   */
#define LL_GFXTIM_EVENTGEN_EVENT_3_IT             GFXTIM_IER_EV3IE    /*!< Enable event generator 3 interruption                                   */
#define LL_GFXTIM_EVENTGEN_EVENT_4_IT             GFXTIM_IER_EV4IE    /*!< Enable event generator 4 interruption                                   */
#define LL_GFXTIM_WDG_PREALARM_IT                 GFXTIM_IER_WDGPIE   /*!< Enable watchdog pre-alarm interruption                                  */
#define LL_GFXTIM_WDG_ALARM_IT                    GFXTIM_IER_WDGAIE   /*!< Enable watchdog alarm interruption                                      */
#define LL_GFXTIM_WDG_ALL_IT                      (GFXTIM_IER_WDGAIE | GFXTIM_IER_WDGPIE)  /*!< Enable watchdog alarm and pre-alarm interruption s */

#define LL_GFXTIM_ALL_IT                          (GFXTIM_IER_AFCOIE  | GFXTIM_IER_ALCOIE  | GFXTIM_IER_TEIE    | \
                                                   GFXTIM_IER_AFCC1IE | GFXTIM_IER_ALCC1IE | GFXTIM_IER_ALCC2IE | \
                                                   GFXTIM_IER_RFC1RIE | GFXTIM_IER_RFC2RIE | GFXTIM_IER_EV1IE   | \
                                                   GFXTIM_IER_EV2IE   | GFXTIM_IER_EV3IE   | GFXTIM_IER_EV4IE   | \
                                                   GFXTIM_IER_WDGPIE  | GFXTIM_IER_WDGAIE)  /*!< Enable all interruptions                           */
/**
  * @}
  */

/**
  * @}
  */
/* Exported macros ---------------------------------------------------------------------------------------------------*/

/** @defgroup GFXTIM_LL_Exported_Macros GFXTIM Exported Macros
  * @{
  */

/** @defgroup GFXTIM_LL_EM_COMMON_WRITE_READ_REGISTERS Common Write and Read Registers macros
  * @{
  */

/**
  * @brief  Read a value in GFXTIM register.
  * @param  instance GFXTIM Instance.
  * @param  reg      Register to be read.
  * @retval Register value.
  */
#define LL_GFXTIM_READ_REG(instance, reg) READ_REG((instance)->reg)

/**
  * @brief  Write a value in GFXTIM register.
  * @param  instance GFXTIM Instance.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  */
#define LL_GFXTIM_WRITE_REG(instance, reg, value) WRITE_REG(((instance)->reg), (value))
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup GFXTIM_LL_Exported_Functions GFXTIM Exported Functions
  * @{
  */

/** @defgroup GFXTIM_LL_EF_GFXTIM GFXTIM
  * @{
  */

/** @defgroup LL_GFXTIM_TEARING_EFFECT GFXTIM Tearing-effect
  * @{
  */

/**
  * @brief  Set the tearing-effect (source and polarity).
  * @rmtoll
  *  CR              TES          LL_GFXTIM_TE_Config \n
  *  CR              TEPOL        LL_GFXTIM_TE_Config
  * @param  gfxtim   GFXTIM instance.
  * @param  source   This parameter can be one of the following values:
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_GPIO
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_HSYNC
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_VSYNC
  * @param  polarity This parameter can be one of the following values:
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_RISING_EDGE
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_FALLING_EDGE
  */
__STATIC_INLINE void LL_GFXTIM_TE_Config(GFXTIM_TypeDef *gfxtim, uint32_t source, uint32_t polarity)
{
  MODIFY_REG(gfxtim->CR, (GFXTIM_CR_TES | GFXTIM_CR_TEPOL), (source | polarity));
}

/**
  * @brief  Set the tearing-effect source.
  * @rmtoll
  *  CR        TES      LL_GFXTIM_TE_SetSource
  * @param  gfxtim GFXTIM instance.
  * @param  source This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_TEARING_EFFECT_GPIO
  *                @arg @ref LL_GFXTIM_TEARING_EFFECT_HSYNC
  *                @arg @ref LL_GFXTIM_TEARING_EFFECT_VSYNC
  */
__STATIC_INLINE void LL_GFXTIM_TE_SetSource(GFXTIM_TypeDef *gfxtim, uint32_t source)
{
  MODIFY_REG(gfxtim->CR, GFXTIM_CR_TES, source);
}

/**
  * @brief  Get the tearing-effect source.
  * @rmtoll
  *  CR              TES          LL_GFXTIM_TE_GetSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_TEARING_EFFECT_GPIO
  *         @arg @ref LL_GFXTIM_TEARING_EFFECT_HSYNC
  *         @arg @ref LL_GFXTIM_TEARING_EFFECT_VSYNC
  */
__STATIC_INLINE uint32_t LL_GFXTIM_TE_GetSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CR, GFXTIM_CR_TES));
}

/**
  * @brief  Set the tearing-effect polarity.
  * @rmtoll
  *  CR        TEPOL      LL_GFXTIM_TE_SetPolarity
  * @param  gfxtim   GFXTIM instance.
  * @param  polarity This parameter can be one of the following values:
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_RISING_EDGE
  *                  @arg @ref LL_GFXTIM_TEARING_EFFECT_FALLING_EDGE
  */
__STATIC_INLINE void LL_GFXTIM_TE_SetPolarity(GFXTIM_TypeDef *gfxtim, uint32_t polarity)
{
  MODIFY_REG(gfxtim->CR, GFXTIM_CR_TEPOL, polarity);
}

/**
  * @brief  Get the tearing-effect polarity.
  * @rmtoll
  *  CR              TEPOL          LL_GFXTIM_TE_GetPolarity
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_TEARING_EFFECT_RISING_EDGE
  *         @arg @ref LL_GFXTIM_TEARING_EFFECT_FALLING_EDGE
  */
__STATIC_INLINE uint32_t LL_GFXTIM_TE_GetPolarity(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CR, GFXTIM_CR_TEPOL));
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_CLOCK_GENERATOR GFXTIM Clock generator
  * @{
  */

/**
  * @brief  Set line clock counter reload value.
  * @rmtoll
  *  LCCRR        RELOAD      LL_GFXTIM_CLKGEN_SetLineReloadValue
  * @param  gfxtim     GFXTIM instance.
  * @param  reload_val Value between 0x0 and 0x3FFFFF
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetLineReloadValue(GFXTIM_TypeDef *gfxtim, uint32_t reload_val)
{
  MODIFY_REG(gfxtim->LCCRR, GFXTIM_LCCRR_RELOAD, reload_val);
}

/**
  * @brief  Get line clock counter reload value.
  * @rmtoll
  *  LCCRR        RELOAD      LL_GFXTIM_CLKGEN_GetLineReloadValue
  * @param  gfxtim GFXTIM instance.
  * @retval value between 0x0 and 0x3FFFFF
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetLineReloadValue(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->LCCRR, GFXTIM_LCCRR_RELOAD));
}

/**
  * @brief  Set line clock counter hardware reload source.
  * @rmtoll
  *  CGCR        LCCHRS      LL_GFXTIM_CLKGEN_SetLineReloadSource
  * @param  gfxtim     GFXTIM instance.
  * @param  reload_src This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_NO_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_FRAME_UNDERFLOW_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_FALLING_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetLineReloadSource(GFXTIM_TypeDef *gfxtim, uint32_t reload_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_LCCHRS, reload_src);
}

/**
  * @brief  Get line clock counter hardware reload source.
  * @rmtoll
  *  CGCR        LCCHRS      LL_GFXTIM_CLKGEN_SetLineReloadSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_NO_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_FRAME_UNDERFLOW_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_FALLING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_FALLING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_FALLING_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetLineReloadSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_LCCHRS));
}

/**
  * @brief  Set line clock counter clock source.
  * @rmtoll
  *  CGCR        LCCCS      LL_GFXTIM_CLKGEN_SetLineCounterSource
  * @param  gfxtim      GFXTIM instance.
  * @param  counter_src This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_NONE
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_GFXTIMHCLK
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetLineCounterSource(GFXTIM_TypeDef *gfxtim, uint32_t counter_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_LCCCS, counter_src);
}

/**
  * @brief  Get line clock counter clock source.
  * @rmtoll
  *  CGCR        LCCCS      LL_GFXTIM_CLKGEN_GetLineCounterSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_NONE
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_GFXTIMHCLK
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetLineCounterSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_LCCCS));
}

/**
  * @brief  Set line clock source.
  * @rmtoll
  *  CGCR        LCS      LL_GFXTIM_CLKGEN_SetLineClockSource
  * @param  gfxtim    GFXTIM instance.
  * @param  clock_src This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_LCNT_UNDERFLOW
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_FCNT_UNDERFLOW
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_FALLING
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_FALLING
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetLineClockSource(GFXTIM_TypeDef *gfxtim, uint32_t clock_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_LCS, clock_src);
}

/**
  * @brief  Get line clock source.
  * @rmtoll
  *  CGCR        LCS      LL_GFXTIM_CLKGEN_GetLineClockSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_LCNT_UNDERFLOW
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_FCNT_UNDERFLOW
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_FALLING
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetLineClockSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_LCS));
}

/**
  * @brief  Set line clock generator.
  * @rmtoll
  *  CGCR        LCCHRS    LL_GFXTIM_CLKGEN_ConfigLineClock \n
  *  CGCR        LCS       LL_GFXTIM_CLKGEN_ConfigLineClock \n
  *  CGCR        LCCCS     LL_GFXTIM_CLKGEN_ConfigLineClock
  * @param  gfxtim      GFXTIM instance.
  * @param  reload_src  This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_NO_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_FRAME_UNDERFLOW_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_FALLING_RELOAD
  * @param  counter_src This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_NONE
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_GFXTIMHCLK
  * @param  clock_src   This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_LCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_FCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_ConfigLineClock(GFXTIM_TypeDef *gfxtim, uint32_t reload_src, uint32_t counter_src,
                                                      uint32_t clock_src)
{
  MODIFY_REG(gfxtim->CGCR, (GFXTIM_CGCR_LCCHRS | GFXTIM_CGCR_LCCCS | GFXTIM_CGCR_LCS),
             (reload_src | counter_src | clock_src));
}


/**
  * @brief  Set frame clock counter reload value.
  * @rmtoll
  *  FCCRR        RELOAD      LL_GFXTIM_CLKGEN_SetFrameReloadValue
  * @param  gfxtim GFXTIM instance.
  * @param  reload_val Value between 0x0 and 0xFFF
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetFrameReloadValue(GFXTIM_TypeDef *gfxtim, uint32_t reload_val)
{
  MODIFY_REG(gfxtim->FCCRR, GFXTIM_FCCRR_RELOAD, reload_val);
}

/**
  * @brief  Get frame clock counter reload value.
  * @rmtoll
  *  FCCRR        RELOAD      LL_GFXTIM_CLKGEN_GetFrameReloadValue
  * @param  gfxtim GFXTIM instance.
  * @retval value between 0x0 and 0xFFF
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetFrameReloadValue(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->FCCRR, GFXTIM_FCCRR_RELOAD));
}

/**
  * @brief  Set frame clock counter hardware reload source.
  * @rmtoll
  *  CGCR        FCCHRS      LL_GFXTIM_CLKGEN_SetFrameReloadSource
  * @param  gfxtim     GFXTIM instance.
  * @param  reload_src This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_NO_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetFrameReloadSource(GFXTIM_TypeDef *gfxtim, uint32_t reload_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_FCCHRS, reload_src);
}

/**
  * @brief  Get frame clock counter hardware reload source.
  * @rmtoll
  *  CGCR        FCCHRS      LL_GFXTIM_CLKGEN_GetFrameReloadSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_NO_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING_RELOAD
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetFrameReloadSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_FCCHRS));
}

/**
  * @brief  Set frame clock counter clock source.
  * @rmtoll
  *  CGCR        FCCCS      LL_GFXTIM_CLKGEN_SetFrameCounterSource
  * @param  gfxtim      GFXTIM instance.
  * @param  counter_src This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_DISABLE
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetFrameCounterSource(GFXTIM_TypeDef *gfxtim, uint32_t counter_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_FCCCS, counter_src);
}

/**
  * @brief  Get line clock counter clock source.
  * @rmtoll
  *  CGCR        FCCCS      LL_GFXTIM_CLKGEN_GetFrameCounterSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_DISABLE
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetFrameCounterSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_FCCCS));
}

/**
  * @brief  Set line clock source.
  * @rmtoll
  *  CGCR        FCS      LL_GFXTIM_CLKGEN_SetFrameClockSource
  * @param  gfxtim    GFXTIM instance.
  * @param  clock_src This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_LCNT_UNDERFLOW
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_FCNT_UNDERFLOW
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_FALLING
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_FALLING
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_RISING
  *                   @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_SetFrameClockSource(GFXTIM_TypeDef *gfxtim, uint32_t clock_src)
{
  MODIFY_REG(gfxtim->CGCR, GFXTIM_CGCR_FCS, clock_src);
}

/**
  * @brief  Get line clock source.
  * @rmtoll
  *  CGCR        FCS      LL_GFXTIM_CLKGEN_GetFrameClockSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_LCNT_UNDERFLOW
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_FCNT_UNDERFLOW
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_FALLING
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_RISING
  *         @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_FALLING
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_GetFrameClockSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->CGCR, GFXTIM_CGCR_FCS));
}

