STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/**
  * @brief  Set line clock generator.
  * @rmtoll
  *  CGCR        LCCHRS    LL_GFXTIM_CLKGEN_ConfigFrameClock \n
  *  CGCR        LCS       LL_GFXTIM_CLKGEN_ConfigFrameClock \n
  *  CGCR        LCCCS     LL_GFXTIM_CLKGEN_ConfigFrameClock
  * @param  gfxtim      GFXTIM instance.
  * @param  reload_src  This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_NO_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING_RELOAD
  * @param  counter_src This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_DISABLE
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING
  * @param  clock_src   This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_LCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_FCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_ConfigFrameClock(GFXTIM_TypeDef *gfxtim, uint32_t reload_src,
                                                       uint32_t counter_src,
                                                       uint32_t clock_src)
{
  MODIFY_REG(gfxtim->CGCR, (GFXTIM_CGCR_FCCHRS | GFXTIM_CGCR_FCCCS | GFXTIM_CGCR_FCS),
             (reload_src | counter_src | clock_src));
}

/**
  * @brief  Set the frame and line clock generator.
  * @rmtoll
  *  CGCR        LCCHRS | LCS | LCCCS   LL_GFXTIM_CLKGEN_ConfigFrameLineClock \n
  *  CGCR        FCCHRS | FCS | FCCCS   LL_GFXTIM_CLKGEN_ConfigFrameLineClock
  * @param  gfxtim       GFXTIM instance.
  * @param frame_config This parameter must be a combination of the following values:
  *                     frame_config = (frame_reload_src | frame_counter_src | frame_clock_src)
  * @param line_config  This parameter must be a combination of the following values:
  *                     line_config = (line_reload_src | line_counter_src | line_clock_src)
  *
  *   frame_reload_src  This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_NO_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING_RELOAD
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING_RELOAD
  *
  *   frame_counter_src This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_DISABLE
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_LINE_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FCNT_TE_FALLING
  *
  *   frame_clock_src   This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_LCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_FCNT_UNDERFLOW
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_HSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_VSYNC_FALLING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_RISING
  *                     @arg @ref LL_GFXTIM_CLKGEN_FRAME_TE_FALLING
  *
  *   line_reload_src  This parameter must be a combination of all the following values:
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_NO_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_FRAME_UNDERFLOW_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_HSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_VSYNC_FALLING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_RISING_RELOAD
  *                    @arg @ref LL_GFXTIM_CLKGEN_LCNT_TE_FALLING_RELOAD
  *
  *   line_counter_src This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_NONE
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_COUNT_GFXTIMHCLK
  *
  *   line_clock_src   This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_LCNT_UNDERFLOW
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_FCNT_UNDERFLOW
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_RISING
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_HSYNC_FALLING
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_RISING
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_VSYNC_FALLING
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_RISING
  *                    @arg @ref LL_GFXTIM_CLKGEN_LINE_TE_FALLING
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_ConfigFrameLineClock(GFXTIM_TypeDef *gfxtim, uint32_t frame_config,
                                                           uint32_t line_config)
{
  MODIFY_REG(gfxtim->CGCR, (GFXTIM_CGCR_FCCHRS | GFXTIM_CGCR_FCCCS | GFXTIM_CGCR_FCS | GFXTIM_CGCR_LCCHRS |
                            GFXTIM_CGCR_LCCCS | GFXTIM_CGCR_LCS), (frame_config | line_config));
}

/**
  * @brief  Force reload the clock generator counter(s).
  * @rmtoll
  *  CGCR                 FCCFR      LL_GFXTIM_CLKGEN_ForceReloadCounter \n
  *  CGCR                 LCCFR      LL_GFXTIM_CLKGEN_ForceReloadCounter
  * @param  gfxtim         GFXTIM instance.
  * @param  counter_reload This parameter can be one of the following values:
  *                        @arg @ref LL_GFXTIM_LINE_FORCE_RELOAD
  *                        @arg @ref LL_GFXTIM_FRAME_FORCE_RELOAD
  *                        @arg @ref LL_GFXTIM_LINE_FRAME_FORCE_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_ForceReloadCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter_reload)
{
  SET_BIT(gfxtim->CGCR, counter_reload);
}

/**
  * @brief  Enable the frame clock calibration output.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_EnableFrameClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_EnableFrameClkCalibOutput(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->CR, GFXTIM_CR_FCCOE);
}

/**
  * @brief  Disable the frame clock calibration output.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_DisableFrameClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_DisableFrameClkCalibOutput(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->CR, GFXTIM_CR_FCCOE);
}

/**
  * @brief  Check if the frame clock calibration output is enabled.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_IsEnabledFrameClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_IsEnabledFrameClkCalibOutput(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->CR, GFXTIM_CR_FCCOE) == (GFXTIM_CR_FCCOE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the frame clock calibration output.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_EnableLineClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_EnableLineClkCalibOutput(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->CR, GFXTIM_CR_LCCOE);
}

/**
  * @brief  Disable the frame clock calibration output.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_DisableLineClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_CLKGEN_DisableLineClkCalibOutput(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->CR, GFXTIM_CR_LCCOE);
}

/**
  * @brief  Check if the frame clock calibration output is enabled.
  * @rmtoll
  *  CR        FCCOE      LL_GFXTIM_CLKGEN_IsEnabledLineClkCalibOutput
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_CLKGEN_IsEnabledLineClkCalibOutput(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->CR, GFXTIM_CR_LCCOE) == (GFXTIM_CR_LCCOE)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_ABSOLUTE_TIMER GFXTIM Absolute timer
  * @{
  */

/**
  * @brief  Set the absolute line compare 1 value.
  * @rmtoll
  *  ALCC2R      LINE      LL_GFXTIM_ABSTIM_SetLineCompare1Value
  * @param  gfxtim GFXTIM instance.
  * @param  value  Value between 0x0 and 0xFFF
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetLineCompare1Value(GFXTIM_TypeDef *gfxtim, uint32_t value)
{
  MODIFY_REG(gfxtim->ALCC1R, GFXTIM_ALCC1R_LINE, value);
}

/**
  * @brief  Get the absolute line compare 1 value.
  * @rmtoll
  *  ALCC1R      LINE      LL_GFXTIM_ABSTIM_GetLineCompare1Value
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetLineCompare1Value(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->ALCC1R, GFXTIM_ALCC1R_LINE));
}

/**
  * @brief  Set the absolute line compare 2 value.
  * @rmtoll
  *  ALCC2R      LINE      LL_GFXTIM_ABSTIM_SetLineCompare2Value
  * @param  gfxtim GFXTIM instance.
  * @param  value  Value between 0x0 and 0xFFF
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetLineCompare2Value(GFXTIM_TypeDef *gfxtim, uint32_t value)
{
  MODIFY_REG(gfxtim->ALCC2R, GFXTIM_ALCC2R_LINE, value);
}

/**
  * @brief  Get the absolute line compare 2 value.
  * @rmtoll
  *  ALCC2R      LINE      LL_GFXTIM_ABSTIM_GetLineCompare2Value
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetLineCompare2Value(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->ALCC2R, GFXTIM_ALCC2R_LINE));
}

/**
  * @brief  Set the absolute line compare value.
  * @rmtoll
  *  ALCC1R      LINE      LL_GFXTIM_ABSTIM_SetLineCompareValue \n
  *  ALCC2R      LINE      LL_GFXTIM_ABSTIM_SetLineCompareValue
  * @param  gfxtim GFXTIM instance.
  * @param  comp   This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP_1
  *                @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP_2
  * @param  value  Value between 0x0 and 0xFFF
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetLineCompareValue(const GFXTIM_TypeDef *gfxtim, uint32_t comp, uint32_t value)
{
  uint32_t reg_addr = (uint32_t)&gfxtim->ALCC1R;
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + comp), GFXTIM_ALCC1R_LINE, value);
}

/**
  * @brief  Get the absolute line compare value.
  * @rmtoll
  *  ALCC1R      LINE      LL_GFXTIM_ABSTIM_GetLineCompareValue \n
  *  ALCC2R      LINE      LL_GFXTIM_ABSTIM_GetLineCompareValue
  * @param  gfxtim GFXTIM instance.
  * @param  comp   This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP_1
  *                @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP_2
  * @retval Value between 0x0 and 0xFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetLineCompareValue(const GFXTIM_TypeDef *gfxtim, uint32_t comp)
{
  uint32_t reg_addr = (uint32_t) &(gfxtim->ALCC1R) + comp;
  return (READ_BIT(*(__IO uint32_t *)reg_addr, GFXTIM_ALCC1R_LINE));
}

/**
  * @brief  Set the absolute line counter value.
  * @rmtoll
  *  ALCR      LINE      LL_GFXTIM_ABSTIM_SetLineCounter
  * @param  gfxtim GFXTIM instance.
  * @param  value  Value between 0x0 and 0xFFF
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetLineCounter(GFXTIM_TypeDef *gfxtim, uint32_t value)
{
  MODIFY_REG(gfxtim->ALCR, GFXTIM_ALCR_LINE, value);
}

/**
  * @brief  Get the absolute line counter value.
  * @rmtoll
  *  ALCR      LINE      LL_GFXTIM_ABSTIM_GetLineCounterStartValue
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetLineCounter(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->ALCR, GFXTIM_ALCR_LINE));
}

/**
  * @brief  Enable the absolute line counter.
  * @rmtoll
  *  TCR        ALCEN      LL_GFXTIM_ABSTIM_EnableLineCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_EnableLineCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_ALCEN);
}

/**
  * @brief  Disable the absolute line counter.
  * @rmtoll
  *  TDR        ALCDIS      LL_GFXTIM_ABSTIM_DisableLineCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_DisableLineCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TDR, GFXTIM_TDR_ALCDIS);
}

/**
  * @brief  Check that absolute line counter is enabled.
  * @rmtoll
  *  TSR        ALCS      LL_GFXTIM_ABSTIM_IsEnabledLineCounter
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_IsEnabledLineCounter(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->TSR, GFXTIM_TSR_ALCS) == (GFXTIM_TSR_ALCS)) ? 1UL : 0UL);
}

/**
  * @brief  Force reset the absolute line counter.
  * @rmtoll
  *  TCR        FALCR      LL_GFXTIM_ABSTIM_ForceResetLineCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_ForceResetLineCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_FALCR);
}

/**
  * @brief  Set the absolute frame compare value.
  * @rmtoll
  *  AFCC1R      FRAME      LL_GFXTIM_ABSTIM_SetFrameCompareValue
  * @param  gfxtim GFXTIM instance.
  * @param  value  Value between 0x0 and 0xFFFFF.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetFrameCompareValue(GFXTIM_TypeDef *gfxtim, uint32_t value)
{
  MODIFY_REG(gfxtim->AFCC1R, GFXTIM_AFCC1R_FRAME, value);
}

/**
  * @brief  Get the absolute frame compare value.
  * @rmtoll
  *  AFCC1R      FRAME      LL_GFXTIM_ABSTIM_GetFrameCompareValue
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetFrameCompareValue(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->AFCC1R, GFXTIM_AFCC1R_FRAME));
}

/**
  * @brief  Set the absolute frame start counter value.
  * @rmtoll
  *  AFCR      FRAME      LL_GFXTIM_ABSTIM_SetFrameCounter
  * @param  gfxtim GFXTIM instance.
  * @param  value  Value between 0x0 and 0xFFFFF.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_SetFrameCounter(GFXTIM_TypeDef *gfxtim, uint32_t value)
{
  MODIFY_REG(gfxtim->AFCR, GFXTIM_AFCR_FRAME, value);
}

/**
  * @brief  Get the absolute frame start counter value.
  * @rmtoll
  *  AFCR      FRAME      LL_GFXTIM_ABSTIM_GetFrameCounter
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetFrameCounter(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->AFCR, GFXTIM_AFCR_FRAME));
}

/**
  * @brief  Enable the absolute frame counter.
  * @rmtoll
  *  TCR        AFCEN      LL_GFXTIM_ABSTIM_EnableFrameCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_EnableFrameCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_AFCEN);
}

/**
  * @brief  Disable the absolute frame counter.
  * @rmtoll
  *  TDR        AFCDIS      LL_GFXTIM_ABSTIM_DisableFrameCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_DisableFrameCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TDR, GFXTIM_TDR_AFCDIS);
}

/**
  * @brief  Check that absolute frame counter is enabled.
  * @rmtoll
  *  TSR        AFCS      LL_GFXTIM_ABSTIM_IsEnabledFrameCounter
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_IsEnabledFrameCounter(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->TSR, GFXTIM_TSR_AFCS) == (GFXTIM_TSR_AFCS)) ? 1UL : 0UL);
}

/**
  * @brief  Force reset the absolute frame counter.
  * @rmtoll
  *  TCR        FAFCR      LL_GFXTIM_ABSTIM_ForceResetFrameCounter
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_ForceResetFrameCounter(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_FAFCR);
}

/**
  * @brief  Get the absolute line and frame counters value.
  * @rmtoll
  *  ATR      LINE      LL_GFXTIM_ABSTIM_GetCounter \n
  *  ATR      FRAME     LL_GFXTIM_ABSTIM_GetCounter
  * @param  gfxtim GFXTIM instance.
  * @note   The return value contains absolute line and frame value:
  *         - Absolute line value : from bit 0 to bit 11.
  *         - Absolute frame value: from bit 12 to bit 31.
  * @retval Value between 0x0 and 0xFFFFFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_GetCounter(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->ATR, (GFXTIM_ATR_LINE | GFXTIM_ATR_FRAME)));
}

/**
  * @brief  Enable the absolute timer(s).
  * @rmtoll
  *  TCR        AFCEN      LL_GFXTIM_ABSTIM_EnableCounter \n
  *  TCR        ACCEN      LL_GFXTIM_ABSTIM_EnableCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNTER
  *                 @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNTER
  *                 @arg @ref LL_GFXTIM_ABSTIM_LINE_FRAME_COUNTER
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_EnableCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_ALCEN | GFXTIM_TCR_AFCEN), counter);
}

/**
  * @brief  Disable the absolute timer(s).
  * @rmtoll
  *  TDR        AFCDIS      LL_GFXTIM_ABSTIM_DisableCounter \n
  *  TDR        ALCDIS      LL_GFXTIM_ABSTIM_DisableCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNTER
  *                 @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNTER
  *                 @arg @ref LL_GFXTIM_ABSTIM_LINE_FRAME_COUNTER
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_DisableCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  SET_BIT(gfxtim->TDR, counter);
}

/**
  * @brief  Check that absolute timer  is enabled.
  * @rmtoll
  *  TDR        ALCS      LL_GFXTIM_ABSTIM_IsEnabledCounter \n
  *  TDR        AFCS      LL_GFXTIM_ABSTIM_IsEnabledCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNTER
  *                 @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNTER
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_ABSTIM_IsEnabledCounter(const GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  return ((READ_BIT(gfxtim->TSR, counter) == (counter)) ? 1UL : 0UL);
}

/**
  * @brief  Force reset the absolute counter.
  * @rmtoll
  *  TCR        FAFCR      LL_GFXTIM_ABSTIM_ForceResetCounter \n
  *  TCR        FALCR      LL_GFXTIM_ABSTIM_ForceResetCounter
  * @param  gfxtim        GFXTIM instance.
  * @param  counter_reset This parameter can be one of the following values:
  *                       @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNTER_RESET
  *                       @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNTER_RESET
  *                       @arg @ref LL_GFXTIM_ABSTIM_LINE_FRAME_COUNTER_RESET
  */
__STATIC_INLINE void LL_GFXTIM_ABSTIM_ForceResetCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter_reset)
{
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_FAFCR | GFXTIM_TCR_FALCR), counter_reset);
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_RELATIVE_TIMER GFXTIM Relative timer
  * @{
  */

/**
  * @brief  Enable the relative frame counter 1.
  * @rmtoll
  *  TCR        RFC1EN      LL_GFXTIM_RELTIM_EnableFrameCounter1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_EnableFrameCounter1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_RFC1EN);
}

/**
  * @brief  Disable the relative frame counter 1.
  * @rmtoll
  *  TDR        RFC1DIS      LL_GFXTIM_RELTIM_DisableFrameCounter1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_DisableFrameCounter1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TDR, GFXTIM_TDR_RFC1DIS);
}

/**
  * @brief  Check that relative frame counter 1 is enabled.
  * @rmtoll
  *  TSR        RFC1DIS      LL_GFXTIM_RELTIM_IsEnabledFrameCounter1
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_IsEnabledFrameCounter1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->TSR, GFXTIM_TSR_RFC1S) == (GFXTIM_TSR_RFC1S)) ? 1UL : 0UL);
}

/**
  * @brief  Set the relative frame counter 1 mode.
  * @rmtoll
  *  TCR        RFC1CM      LL_GFXTIM_RELTIM_SetCounter1Mode
  * @param  gfxtim GFXTIM instance.
  * @param  mode   This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *                @arg @ref LL_GFXTIM_RELTIM_COUNTER_1_CONTINUOUS
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_SetCounter1Mode(GFXTIM_TypeDef *gfxtim, uint32_t mode)
{
  MODIFY_REG(gfxtim->TCR, GFXTIM_TCR_RFC1CM, mode);
}

/**
  * @brief  Get the relative frame counter 1 mode.
  * @rmtoll
  *  TCR        RFC1CM      LL_GFXTIM_RELTIM_GetCounter1Mode
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_1_CONTINUOUS
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_GetCounter1Mode(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->TCR, GFXTIM_TCR_RFC1CM));
}

/**
  * @brief  Enable the relative frame counter 2.
  * @rmtoll
  *  TCR        RFC2EN      LL_GFXTIM_RELTIM_EnableFrameCounter2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_EnableFrameCounter2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_RFC2EN);
}

/**
  * @brief  Disable the relative frame counter 2.
  * @rmtoll
  *  TDR        RFC2DIS      LL_GFXTIM_RELTIM_DisableFrameCounter2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_DisableFrameCounter2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TDR, GFXTIM_TDR_RFC2DIS);
}

