STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/**
  * @brief  Check that relative frame counter 2 is enabled.
  * @rmtoll
  *  TSR        RFC2S      LL_GFXTIM_RELTIM_IsEnabledFrameCounter2
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_IsEnabledFrameCounter2(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->TSR, GFXTIM_TSR_RFC2S) == (GFXTIM_TSR_RFC2S)) ? 1UL : 0UL);
}

/**
  * @brief  Set the relative frame counter 2 mode.
  * @rmtoll
  *  TCR        RFC2CM      LL_GFXTIM_RELTIM_SetCounter2Mode
  * @param  gfxtim GFXTIM instance.
  * @param  mode   This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *                @arg @ref LL_GFXTIM_RELTIM_COUNTER_2_CONTINUOUS
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_SetCounter2Mode(GFXTIM_TypeDef *gfxtim, uint32_t mode)
{
  MODIFY_REG(gfxtim->TCR, GFXTIM_TCR_RFC2CM, mode);
}

/**
  * @brief  Get the relative frame counter 2 mode.
  * @rmtoll
  *  TCR        RFC2CM      LL_GFXTIM_RELTIM_GetCounter2Mode
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_2_CONTINUOUS
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_GetCounter2Mode(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->TCR, GFXTIM_TCR_RFC2CM));
}

/**
  * @brief  Enable the relative frame counter.
  * @rmtoll
  *  TCR        RFC1EN      LL_GFXTIM_RELTIM_EnableFrameCounter \n
  *  TCR        RFC2EN      LL_GFXTIM_RELTIM_EnableFrameCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_EnableFrameCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_RFC1EN | GFXTIM_TCR_RFC2EN), counter);
}

/**
  * @brief  Disable the relative frame counter.
  * @rmtoll
  *  TDR        RFC1DIS      LL_GFXTIM_RELTIM_DisableFrameCounter \n
  *  TDR        RFC2DIS      LL_GFXTIM_RELTIM_DisableFrameCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_DisableFrameCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  MODIFY_REG(gfxtim->TDR, (GFXTIM_TDR_RFC1DIS | GFXTIM_TDR_RFC2DIS), counter);
}

/**
  * @brief  Check that relative frame counter 2 is enabled.
  * @rmtoll
  *  TSR        RFC1S      LL_GFXTIM_RELTIM_IsEnabledFrameCounter \n
  *  TSR        RFC2S      LL_GFXTIM_RELTIM_IsEnabledFrameCounter
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_IsEnabledFrameCounter(const GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  return ((READ_BIT(gfxtim->TSR, counter) == (counter)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the relative counter in continuous mode.
  * @rmtoll
  *  TCR        RFC1EN      LL_GFXTIM_RELTIM_EnableContinuous \n
  *  TCR        RFC2EN      LL_GFXTIM_RELTIM_EnableContinuous
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_EnableContinuous(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  SET_BIT(gfxtim->TCR, ((counter << 1U) | counter));
}

/**
  * @brief  Enable the relative counter in one shot mode.
  * @rmtoll
  *  TCR        RFC1EN      LL_GFXTIM_RELTIM_EnableOneShot \n
  *  TCR        RFC2EN      LL_GFXTIM_RELTIM_EnableOneShot
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_EnableOneShot(GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  uint32_t mask = READ_REG(gfxtim->TCR);
  mask &= ~(counter << 1U);
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_RFC1CM | GFXTIM_TCR_RFC1EN | GFXTIM_TCR_RFC2CM | GFXTIM_TCR_RFC2EN),
             (mask | counter));
}

/**
  * @brief  Set the relative frame counter mode.
  * @rmtoll
  *  TCR        RFC1CM      LL_GFXTIM_RELTIM_SetCounterMode \n
  *  TCR        RFC2CM      LL_GFXTIM_RELTIM_SetCounterMode
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  * @param  mode    This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_CONTINUOUS
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_SetCounterMode(GFXTIM_TypeDef *gfxtim, uint32_t counter, uint32_t mode)
{
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_RFC1CM | GFXTIM_TCR_RFC2CM), ((mode << 1U) << POSITION_VAL(counter)));
}

/**
  * @brief  Get the relative frame counter mode.
  * @rmtoll
  *  TCR        RFC1CM      LL_GFXTIM_RELTIM_GetCounterMode \n
  *  TCR        RFC2CM      LL_GFXTIM_RELTIM_GetCounterMode
  * @param  gfxtim   GFXTIM instance.
  * @param  counter  This parameter can be one of the following values:
  *                  @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                  @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_ONESHOT
  *         @arg @ref LL_GFXTIM_RELTIM_COUNTER_CONTINUOUS
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_GetCounterMode(const GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  return (READ_BIT(gfxtim->TCR, (counter << 1U)));
}

/**
  * @brief  Set reload value of the relative frame counter.
  * @rmtoll
  *  RFC1RR            FRAME      LL_GFXTIM_RELTIM_SetReloadValue \n
  *  RFC2RR            FRAME      LL_GFXTIM_RELTIM_SetReloadValue
  * @param  gfxtim         GFXTIM instance.
  * @param  counter        This parameter can be one of the following values:
  *                        @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                        @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  * @param  autoreload_val This parameter can be a value between 0x0 and 0xFFF.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_SetReloadValue(const GFXTIM_TypeDef *gfxtim, uint32_t counter,
                                                     uint32_t autoreload_val)
{
  uint32_t reg_addr = (uint32_t)&gfxtim->RFC1RR;
  MODIFY_REG(*(__IO uint32_t *)(reg_addr + ((POSITION_VAL(counter) - 16U) * 2U)), GFXTIM_RFC1RR_FRAME, autoreload_val);
}

/**
  * @brief  Force reload the relative frame counter.
  * @rmtoll
  *  TCR               FRFC1R      LL_GFXTIM_RELTIM_ForceReloadCounter \n
  *  TCR               FRFC2R      LL_GFXTIM_RELTIM_ForceReloadCounter
  * @param  gfxtim         GFXTIM instance.
  * @param  counter_reload This parameter can be one of the following values:
  *                        @arg @ref LL_GFXTIM_RELTIM_COUNTER_1_FORCE_RELOAD
  *                        @arg @ref LL_GFXTIM_RELTIM_COUNTER_2_FORCE_RELOAD
  *                        @arg @ref LL_GFXTIM_RELTIM_COUNTER_ALL_FORCE_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_ForceReloadCounter(GFXTIM_TypeDef *gfxtim, uint32_t counter_reload)
{
  MODIFY_REG(gfxtim->TCR, (GFXTIM_TCR_FRFC1R | GFXTIM_TCR_FRFC2R), counter_reload);
}

/**
  * @brief  Force reload the relative frame counter 1.
  * @rmtoll
  *  TCR        FRFC1R      LL_GFXTIM_RELTIM_ForceReloadCounter1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_ForceReloadCounter1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_FRFC1R);
}

/**
  * @brief  Force reload the relative frame counter 2.
  * @rmtoll
  *  TCR        FRFC1R      LL_GFXTIM_RELTIM_ForceReloadCounter2
  */
__STATIC_INLINE void LL_GFXTIM_RELTIM_ForceReloadCounter2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->TCR, GFXTIM_TCR_FRFC2R);
}
/**
  * @brief  Get the relative frame counter value.
  * @rmtoll
  *  RFC1R      FRAME      LL_GFXTIM_RELTIM_GetCounterValue \n
  *  RFC2R      FRAME      LL_GFXTIM_RELTIM_GetCounterValue
  * @param  gfxtim  GFXTIM instance.
  * @param  counter This parameter can be one of the following values:
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_1
  *                 @arg @ref LL_GFXTIM_RELTIM_COUNTER_2
  * @retval Value between 0x0 and 0xFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_RELTIM_GetCounterValue(const GFXTIM_TypeDef *gfxtim, uint32_t counter)
{
  uint32_t reg_addr = (uint32_t)&gfxtim->RFC1R;
  return (READ_BIT(*(__IO uint32_t *)(reg_addr + ((POSITION_VAL(counter) - 16U) * 2U)), GFXTIM_RFC1R_FRAME));
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_EVENT_GENERATOR GFXTIM Event generator
  * @{
  */

/**
  * @brief  Configure the event generator.
  * @rmtoll
  *  EVSR        FESx x = [1..4]     LL_GFXTIM_EVENTGEN_Config \n
  *  EVSR        LESx x = [1..4]     LL_GFXTIM_EVENTGEN_Config
  * @param  gfxtim      GFXTIM instance.
  * @param  event_gen   This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @param  line_event  This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_Config(GFXTIM_TypeDef *gfxtim, uint32_t event_gen, uint32_t line_event,
                                               uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, ((GFXTIM_EVSR_LES1 | GFXTIM_EVSR_FES1) << (POSITION_VAL(event_gen) * 8U)),
             ((line_event | frame_event) << (POSITION_VAL(event_gen) * 8U)));
}

/**
  * @brief  Configure the line event generator.
  * @rmtoll
  *  EVSR        LESx x = [1..4]     LL_GFXTIM_EVENTGEN_SetLineEventSel
  * @param  gfxtim     GFXTIM instance.
  * @param  event_gen  This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                    @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                    @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                    @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @param  line_event This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetLineEventSel(GFXTIM_TypeDef *gfxtim, uint32_t event_gen, uint32_t line_event)
{
  MODIFY_REG(gfxtim->EVSR, (GFXTIM_EVSR_LES1 << (POSITION_VAL(event_gen) * 8U)),
             (line_event << (POSITION_VAL(event_gen) * 8U)));
}

/**
  * @brief  Get line event generator configuration.
  * @rmtoll
  *  EVSR         LESx   x = [1..4]    LL_GFXTIM_EVENTGEN_GetLineEventSel
  * @param  gfxtim   GFXTIM instance.
  * @param  event_gen This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *         @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetLineEventSel(const GFXTIM_TypeDef *gfxtim, uint32_t event_gen)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_LES1 << (POSITION_VAL(event_gen) * 8U)) >> (POSITION_VAL(event_gen) * 8U));
}

/**
  * @brief  Configure the event generator.
  * @rmtoll
  *  EVSR        FESx x = [1..4]     LL_GFXTIM_EVENTGEN_SetFrameEventSel
  * @param  gfxtim      GFXTIM instance.
  * @param  event_gen   This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                     @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetFrameEventSel(GFXTIM_TypeDef *gfxtim, uint32_t event_gen,
                                                         uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, (GFXTIM_EVSR_FES1 << (POSITION_VAL(event_gen) * 8U)),
             (frame_event << (POSITION_VAL(event_gen) * 8U)));
}

/**
  * @brief  Get frame event generator configuration.
  * @rmtoll
  *  EVSR      LESx  LESx x = [1..4]    LL_GFXTIM_EVENTGEN_GetFrameEventSel
  * @param  gfxtim    GFXTIM instance.
  * @param  event_gen This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *         @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *         @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetFrameEventSel(const GFXTIM_TypeDef *gfxtim, uint32_t event_gen)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_FES1 << (POSITION_VAL(event_gen) * 8U)) >> (POSITION_VAL(event_gen) * 8U));
}

/**
  * @brief  Set the line event generator 1.
  * @rmtoll
  *  EVSR        LES1             LL_GFXTIM_EVENTGEN_SetLineEventSel1
  * @param  gfxtim     GFXTIM instance.
  * @param  line_event This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetLineEventSel1(GFXTIM_TypeDef *gfxtim, uint32_t line_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_LES1, (line_event << GFXTIM_EVSR_LES1_Pos));
}

/**
  * @brief  Get line event generator 1.
  * @rmtoll
  *  EVSR        LES1             LL_GFXTIM_EVENTGEN_GetLine1
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *         @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *         @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetLineEventSel1(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_LES1));
}

/**
  * @brief  Set the frame event generator 1.
  * @rmtoll
  *  EVSR        FES1             LL_GFXTIM_EVENTGEN_SetFrameEventSel1
  * @param  gfxtim      GFXTIM instance.
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetFrameEventSel1(GFXTIM_TypeDef *gfxtim, uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_FES1, (frame_event << GFXTIM_EVSR_LES1_Pos));
}

/**
  * @brief  Get frame event generator 1.
  * @rmtoll
  *  EVSR        FES1             LL_GFXTIM_EVENTGEN_GetFrame1
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetFrameEventSel1(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_FES1));
}

/**
  * @brief  Set the line event generator 2.
  * @rmtoll
  *  EVSR        LES2             LL_GFXTIM_EVENTGEN_SetLineEventSel2
  * @param  gfxtim     GFXTIM instance.
  * @param  line_event This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetLineEventSel2(GFXTIM_TypeDef *gfxtim, uint32_t line_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_LES2, (line_event << GFXTIM_EVSR_LES2_Pos));
}

/**
  * @brief  Get line event generator 2.
  * @rmtoll
  *  EVSR        LES2             LL_GFXTIM_EVENTGEN_GetLineEventSel2
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetLineEventSel2(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_LES2) >> GFXTIM_EVSR_LES2_Pos);
}

/**
  * @brief  Set the frame event generator 2.
  * @rmtoll
  *  EVSR        FES2             LL_GFXTIM_EVENTGEN_SetFrameEventSel2
  * @param  gfxtim      GFXTIM instance.
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetFrameEventSel2(GFXTIM_TypeDef *gfxtim, uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_FES2, (frame_event << GFXTIM_EVSR_LES2_Pos));
}

/**
  * @brief  Get frame event generator 2.
  * @rmtoll
  *  EVSR        FES2             LL_GFXTIM_EVENTGEN_GetFrameEventSel2
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetFrameEventSel2(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_FES2) >> GFXTIM_EVSR_LES2_Pos);
}

/**
  * @brief  Set the line event generator 3.
  * @rmtoll
  *  EVSR        LES3             LL_GFXTIM_EVENTGEN_SetLineEventSel3
  * @param  gfxtim     GFXTIM instance.
  * @param  line_event This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetLineEventSel3(GFXTIM_TypeDef *gfxtim, uint32_t line_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_LES3, (line_event << GFXTIM_EVSR_LES3_Pos));
}

/**
  * @brief  Get line event generator 3.
  * @rmtoll
  *  EVSR        LES3             LL_GFXTIM_EVENTGEN_GetLineEventSel3
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetLineEventSel3(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_LES3) >> GFXTIM_EVSR_LES3_Pos);
}

/**
  * @brief  Set the frame event generator 3.
  * @rmtoll
  *  EVSR        FES3             LL_GFXTIM_EVENTGEN_SetFrameEventSel3
  * @param  gfxtim      GFXTIM instance.
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetFrameEventSel3(GFXTIM_TypeDef *gfxtim, uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_FES3, (frame_event << GFXTIM_EVSR_LES3_Pos));
}

