STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/**
  * @brief  Get frame event generator 3.
  * @rmtoll
  *  EVSR        FES3             LL_GFXTIM_EVENTGEN_GetFrameEventSel3
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetFrameEventSel3(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_FES3) >> GFXTIM_EVSR_LES3_Pos);
}

/**
  * @brief  Set the line event generator 4.
  * @rmtoll
  *  EVSR        LES4             LL_GFXTIM_EVENTGEN_SetLineEventSel4
  * @param  gfxtim     GFXTIM instance.
  * @param  line_event This parameter can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetLineEventSel4(GFXTIM_TypeDef *gfxtim, uint32_t line_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_LES4, (line_event << GFXTIM_EVSR_LES4_Pos));
}

/**
  * @brief  Get line event generator 4.
  * @rmtoll
  *  EVSR        LES4             LL_GFXTIM_EVENTGEN_GetLineEventSel4
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                    @arg @ref LL_GFXTIM_EVENTGEN_LINE_NONE
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_OVERFLOW
  *                    @arg @ref LL_GFXTIM_EVENTGEN_TEARING_EFFECT
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_1_COMP
  *                    @arg @ref LL_GFXTIM_EVENTGEN_ABS_LCNT_2_COMP
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetLineEventSel4(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_LES4) >> GFXTIM_EVSR_LES4_Pos);
}

/**
  * @brief  Set the frame event generator 4.
  * @rmtoll
  *  EVSR        FES4             LL_GFXTIM_EVENTGEN_SetFrameEventSel4
  * @param  gfxtim      GFXTIM instance.
  * @param  frame_event This parameter can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_SetFrameEventSel4(GFXTIM_TypeDef *gfxtim, uint32_t frame_event)
{
  MODIFY_REG(gfxtim->EVSR, GFXTIM_EVSR_FES4, (frame_event << GFXTIM_EVSR_LES4_Pos));
}

/**
  * @brief  Get frame event generator 4.
  * @rmtoll
  *  EVSR        FES4             LL_GFXTIM_EVENTGEN_GetFrameEventSel4
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *                     @arg @ref LL_GFXTIM_EVENTGEN_FRAME_NONE
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_OVERFLOW
  *                     @arg @ref LL_GFXTIM_EVENTGEN_ABS_FCNT_COMP
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_1_RELOAD
  *                     @arg @ref LL_GFXTIM_EVENTGEN_REL_FCNT_2_RELOAD
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_GetFrameEventSel4(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->EVSR, GFXTIM_EVSR_FES4) >> GFXTIM_EVSR_LES4_Pos);
}

/**
  * @brief  Enable the event generator.
  * @rmtoll
  *  EVCR        EVxEN x = [1..4]     LL_GFXTIM_EVENTGEN_Enable
  * @param  gfxtim    GFXTIM instance.
  * @param  event_gen This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_Enable(GFXTIM_TypeDef *gfxtim, uint32_t event_gen)
{
  SET_BIT(gfxtim->EVCR, event_gen);
}

/**
  * @brief  Disable the event generator.
  * @rmtoll
  *  EVCR        EVxEN x = [1..4]     LL_GFXTIM_EVENTGEN_Disable
  * @param  gfxtim    GFXTIM instance.
  * @param  event_gen This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  */
__STATIC_INLINE void LL_GFXTIM_EVENTGEN_Disable(GFXTIM_TypeDef *gfxtim, uint32_t event_gen)
{
  CLEAR_BIT(gfxtim->EVCR, event_gen);
}

/**
  * @brief  Check that event generator is enabled.
  * @rmtoll
  *  EVCR        EVxEN x = [1..4]      LL_GFXTIM_EVENTGEN_IsEnabled
  * @param  gfxtim    GFXTIM instance.
  * @param  event_gen This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_EVENTGEN_IsEnabled(const GFXTIM_TypeDef *gfxtim, uint32_t event_gen)
{
  return ((READ_BIT(gfxtim->EVCR, event_gen) == (event_gen)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_WATCHDOG_TIMER GFXTIM Watchdog timer
  * @{
  */

/**
  * @brief  Set the watchdog clock source.
  * @rmtoll
  *  WDGTCR        WDGCS     LL_GFXTIM_WDG_SetSource
  * @param  gfxtim GFXTIM instance.
  * @param  source This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_WDG_CLK_LINE_CLK
  *                @arg @ref LL_GFXTIM_WDG_CLK_FRAME_CLK
  *                @arg @ref LL_GFXTIM_WDG_CLK_HSYNC_RISING
  *                @arg @ref LL_GFXTIM_WDG_CLK_HSYNC_FALLING
  *                @arg @ref LL_GFXTIM_WDG_CLK_VSYNC_RISING
  *                @arg @ref LL_GFXTIM_WDG_CLK_VSYNC_FALLING
  *                @arg @ref LL_GFXTIM_WDG_CLK_TE_RISING
  *                @arg @ref LL_GFXTIM_WDG_CLK_TE_FALLING
  *                @arg @ref LL_GFXTIM_WDG_CLK_EVENT_1
  *                @arg @ref LL_GFXTIM_WDG_CLK_EVENT_2
  *                @arg @ref LL_GFXTIM_WDG_CLK_EVENT_3
  *                @arg @ref LL_GFXTIM_WDG_CLK_EVENT_4
  */
__STATIC_INLINE void LL_GFXTIM_WDG_SetSource(GFXTIM_TypeDef *gfxtim, uint32_t source)
{
  MODIFY_REG(gfxtim->WDGTCR, GFXTIM_WDGTCR_WDGCS, source);
}

/**
  * @brief  Get the watchdog source.
  * @rmtoll
  *  WDGTCR        WDGCS     LL_GFXTIM_WDG_GetSource
  * @param  gfxtim GFXTIM instance.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_GFXTIM_WDG_CLK_LINE_CLK
  *         @arg @ref LL_GFXTIM_WDG_CLK_FRAME_CLK
  *         @arg @ref LL_GFXTIM_WDG_CLK_HSYNC_RISING
  *         @arg @ref LL_GFXTIM_WDG_CLK_HSYNC_FALLING
  *         @arg @ref LL_GFXTIM_WDG_CLK_VSYNC_RISING
  *         @arg @ref LL_GFXTIM_WDG_CLK_VSYNC_FALLING
  *         @arg @ref LL_GFXTIM_WDG_CLK_TE_RISING
  *         @arg @ref LL_GFXTIM_WDG_CLK_TE_FALLING
  *         @arg @ref LL_GFXTIM_WDG_CLK_EVENT_1
  *         @arg @ref LL_GFXTIM_WDG_CLK_EVENT_2
  *         @arg @ref LL_GFXTIM_WDG_CLK_EVENT_3
  *         @arg @ref LL_GFXTIM_WDG_CLK_EVENT_4
  */
__STATIC_INLINE uint32_t LL_GFXTIM_WDG_GetSource(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->WDGTCR, GFXTIM_WDGTCR_WDGCS));
}

/**
  * @brief  Set the watchdog reload value.
  * @rmtoll
  *  WDGRR        REALOAD     LL_GFXTIM_WDG_SetReloadValue
  * @param  gfxtim     GFXTIM instance.
  * @param  reload_val This parameter can be a value between 0x0 and 0xFFFF
  */
__STATIC_INLINE void LL_GFXTIM_WDG_SetReloadValue(GFXTIM_TypeDef *gfxtim, uint32_t reload_val)
{
  MODIFY_REG(gfxtim->WDGRR, GFXTIM_WDGRR_RELOAD, reload_val);
}

/**
  * @brief  Get the watchdog reload value.
  * @rmtoll
  *  WDGRR        REALOAD     LL_GFXTIM_WDG_GetReloadValue
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_WDG_GetReloadValue(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->WDGRR, GFXTIM_WDGRR_RELOAD));
}

/**
  * @brief  Get the watchdog counter value.
  * @rmtoll
  *  WDGCR        VALUE     LL_GFXTIM_WDG_GetCounter
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_WDG_GetCounter(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->WDGCR, GFXTIM_WDGCR_VALUE));
}

/**
  * @brief  Set the watchdog pre-alarm value.
  * @rmtoll
  *  WDGPAR        PREALARM     LL_GFXTIM_WDG_SetPrealarmValue
  * @param  gfxtim       GFXTIM instance.
  * @param  prealarm_val This parameter can be a value between 0x0 and 0xFFFF
  */
__STATIC_INLINE void LL_GFXTIM_WDG_SetPrealarmValue(GFXTIM_TypeDef *gfxtim, uint32_t prealarm_val)
{
  MODIFY_REG(gfxtim->WDGPAR, GFXTIM_WDGPAR_PREALARM, prealarm_val);
}

/**
  * @brief  Get the watchdog pre-alarm value.
  * @rmtoll
  *  WDGPAR        PREALARM     LL_GFXTIM_WDG_GetPrealarmValue
  * @param  gfxtim GFXTIM instance.
  * @retval Value between 0x0 and 0xFFFF.
  */
__STATIC_INLINE uint32_t LL_GFXTIM_WDG_GetPrealarmValue(const GFXTIM_TypeDef *gfxtim)
{
  return (READ_BIT(gfxtim->WDGPAR, GFXTIM_WDGPAR_PREALARM));
}

/**
  * @brief  Enable the watchdog timer.
  * @rmtoll
  *  WDGTCR        WDGEN    LL_GFXTIM_WDG_Enable
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_WDG_Enable(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->WDGTCR, GFXTIM_WDGTCR_WDGEN);
}

/**
  * @brief  Disable the watchdog timer.
  * @rmtoll
  *  WDGTCR        WDGDIS    LL_GFXTIM_WDG_Disable
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_WDG_Disable(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->WDGTCR, GFXTIM_WDGTCR_WDGDIS);
}

/**
  * @brief  Check that relative frame counter 2 is enabled.
  * @rmtoll
  *  WDGTCR        WDGS      LL_GFXTIM_WDG_IsEnabled
  * @param  gfxtim GFXTIM instance.
  * @retval State of bit (1UL or 0UL).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_WDG_IsEnabled(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->WDGTCR, GFXTIM_WDGTCR_WDGS) == (GFXTIM_WDGTCR_WDGS)) ? 1UL : 0UL);
}

/**
  * @brief  Refrech the watchdog timer.
  * @rmtoll
  *  WDGTCR        FWDGR    LL_GFXTIM_WDG_Refresh
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_WDG_Refresh(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->WDGTCR, GFXTIM_WDGTCR_FWDGR);
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_IT_MANAGEMENT GFXTIM Interrupt management
  * @{
  */

/**
  * @brief  Enable the specified GFXTIM interrupt.
  * @rmtoll
  *  IER        AFCOIE/ ALCOIE/TEIE/AFCC1IE/ALCC1IE/ALCC2IE              LL_GFXTIM_EnableIT \n
  *             RFC1RIE/RFC2RIE/EV1IE/EV2IE/EV3IE/EV4IE/WDGAIE/WDGPIE    LL_GFXTIM_EnableIT
  * @param  gfxtim    GFXTIM instance.
  * @param  interrupt This parameter can be one or a combination of the following values:
  *                   @arg @ref LL_GFXTIM_NONE_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_TEARING_EFFECT_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COMP_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP1_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP2_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_1_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4_IT
  *                   @arg @ref LL_GFXTIM_WDG_PREALARM_IT
  *                   @arg @ref LL_GFXTIM_WDG_ALARM_IT
  *                   @arg @ref LL_GFXTIM_ALL_IT
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT(GFXTIM_TypeDef *gfxtim, uint32_t interrupt)
{
  SET_BIT(gfxtim->IER, interrupt);
}

/**
  * @brief  Disable the specified GFXTIM interrupt.
  * @rmtoll
  *  IER        AFCOIE/ ALCOIE/TEIE/AFCC1IE/ALCC1IE/ALCC2IE              LL_GFXTIM_DisableIT \n
  *             RFC1RIE/RFC2RIE/EV1IE/EV2IE/EV3IE/EV4IE/WDGAIE/WDGPIE    LL_GFXTIM_DisableIT
  * @param  gfxtim    GFXTIM instance.
  * @param  interrupt This parameter can be one or a combination of the following values:
  *                   @arg @ref LL_GFXTIM_NONE_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_TEARING_EFFECT_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COMP_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP1_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP2_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_1_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4_IT
  *                   @arg @ref LL_GFXTIM_WDG_PREALARM_IT
  *                   @arg @ref LL_GFXTIM_WDG_ALARM_IT
  *                   @arg @ref LL_GFXTIM_ALL_IT
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT(GFXTIM_TypeDef *gfxtim, uint32_t interrupt)
{
  CLEAR_BIT(gfxtim->IER, interrupt);
}

/**
  * @brief  check if the specified GFXTIM interrupt is enabled.
  * @rmtoll
  *  IER        AFCOIE/ ALCOIE/TEIE/AFCC1IE/ALCC1IE/ALCC2IE              LL_GFXTIM_IsEnabledIT \n
  *  IER        RFC1RIE/RFC2RIE/EV1IE/EV2IE/EV3IE/EV4IE/WDGAIE/WDGPIE    LL_GFXTIM_IsEnabledIT
  * @param  gfxtim   GFXTIM instance.
  * @param interrupt This parameter can be one of the following values:
  *                   @arg @ref LL_GFXTIM_NONE_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COUNT_OVERFLOW_IT
  *                   @arg @ref LL_GFXTIM_TEARING_EFFECT_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_FRAME_COMP_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP1_IT
  *                   @arg @ref LL_GFXTIM_ABSTIM_LINE_COMP2_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_1_IT
  *                   @arg @ref LL_GFXTIM_RELTIM_COUNT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_1_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_2_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_3_IT
  *                   @arg @ref LL_GFXTIM_EVENTGEN_EVENT_4_IT
  *                   @arg @ref LL_GFXTIM_WDG_PREALARM_IT
  *                   @arg @ref LL_GFXTIM_WDG_ALARM_IT
  * @retval State of interrupt (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT(const GFXTIM_TypeDef *gfxtim, uint32_t interrupt)
{
  return ((READ_BIT(gfxtim->IER, interrupt) == (interrupt)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the absolute frame counter overflow interrupt.
  * @rmtoll
  *  IER        AFCOIE              LL_GFXTIM_EnableIT_AFCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_AFCO(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_AFCOIE);
}

/**
  * @brief  Disable the absolute frame counter overflow interrupt.
  * @rmtoll
  *  IER        AFCOIE              LL_GFXTIM_DisableIT_AFCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_AFCO(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_AFCOIE);
}

/**
  * @brief  Check if the absolute frame counter overflow interrupt is enabled.
  * @rmtoll
  *  IER        AFCOIE              LL_GFXTIM_IsEnabledIT_AFCO
  * @param  gfxtim GFXTIM instance.
  * @retval State of AFCO (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_AFCO(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_AFCOIE) == (GFXTIM_IER_AFCOIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the absolute line counter overflow interrupt.
  * @rmtoll
  *  IER        ALCOIE              LL_GFXTIM_EnableIT_ALCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_ALCO(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_ALCOIE);
}

/**
  * @brief  Disable the absolute line counter overflow interrupt.
  * @rmtoll
  *  IER        ALCOIE              LL_GFXTIM_DisableIT_ALCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_ALCO(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_ALCOIE);
}

/**
  * @brief  Check if the absolute line counter overflow interrupt is enabled.
  * @rmtoll
  *  IER        ALCOIE              LL_GFXTIM_IsEnabledIT_ALCO
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCO (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_ALCO(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_ALCOIE) == (GFXTIM_IER_ALCOIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the tearing-effect interrupt.
  * @rmtoll
  *  IER        TEIE              LL_GFXTIM_EnableIT_TE
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_TE(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_TEIE);
}

/**
  * @brief  Disable the tearing-effect interrupt.
  * @rmtoll
  *  IER        TEIE              LL_GFXTIM_DisableIT_TE
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_TE(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_TEIE);
}

/**
  * @brief  Check if the tearing-effect interrupt is enabled.
  * @rmtoll
  *  IER        TEIE              LL_GFXTIM_IsEnabledIT_TE
  * @param  gfxtim GFXTIM instance.
  * @retval State of TE (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_TE(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_TEIE) == (GFXTIM_IER_TEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the absolute frame counter compare 1 interrupt.
  * @rmtoll
  *  IER        AFCC1IE              LL_GFXTIM_EnableIT_AFCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_AFCC1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_AFCC1IE);
}

/**
  * @brief  Disable the absolute frame counter compare 1 interrupt.
  * @rmtoll
  *  IER        AFCC1IE              LL_GFXTIM_DisableIT_AFCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_AFCC1(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_AFCC1IE);
}

/**
  * @brief  Check if the absolute frame counter compare 1 interrupt is enabled.
  * @rmtoll
  *  IER        AFCC1IE              LL_GFXTIM_IsEnabledIT_AFCC1
  * @param  gfxtim GFXTIM instance.
  * @retval State of AFCC1 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_AFCC1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_AFCC1IE) == (GFXTIM_IER_AFCC1IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the absolute line counter compare 1 interrupt.
  * @rmtoll
  *  IER        ALCC1IE              LL_GFXTIM_EnableIT_ALCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_ALCC1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_ALCC1IE);
}

/**
  * @brief  Disable the absolute line counter compare 1 interrupt.
  * @rmtoll
  *  IER        ALCC1IE              LL_GFXTIM_DisableIT_ALCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_ALCC1(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_ALCC1IE);
}

/**
  * @brief  Check if the absolute line counter compare 1 interrupt is enabled.
  * @rmtoll
  *  IER        ALCC1IE              LL_GFXTIM_IsEnabledIT_ALCC1
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCC1 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_ALCC1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_ALCC1IE) == (GFXTIM_IER_ALCC1IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the absolute line counter compare 2 interrupt.
  * @rmtoll
  *  IER        ALCC2IE              LL_GFXTIM_EnableIT_ALCC2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_ALCC2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_ALCC2IE);
}

/**
  * @brief  Disable the absolute line counter compare 2 interrupt.
  * @rmtoll
  *  IER        ALCC2IE              LL_GFXTIM_DisableIT_ALCC2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_ALCC2(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_ALCC2IE);
}

/**
  * @brief  Check if the absolute line counter compare 2 interrupt is enabled.
  * @rmtoll
  *  IER        ALCC2IE              LL_GFXTIM_IsEnabledIT_ALCC2
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCC2 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_ALCC2(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_ALCC2IE) == (GFXTIM_IER_ALCC2IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the relative frame counter 1 reload interrupt.
  * @rmtoll
  *  IER        RFC1RIE              LL_GFXTIM_EnableIT_RFC1R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_RFC1R(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_RFC1RIE);
}

/**
  * @brief  Disable the relative frame counter 1 reload interrupt.
  * @rmtoll
  *  IER        RFC1RIE              LL_GFXTIM_DisableIT_RFC1R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_RFC1R(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_RFC1RIE);
}

/**
  * @brief  Check if the relative frame counter 1 reload interrupt is enabled.
  * @rmtoll
  *  IER        RFC1RIE              LL_GFXTIM_IsEnabledIT_RFC1R
  * @param  gfxtim GFXTIM instance.
  * @retval State of RFC1R (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_RFC1R(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_RFC1RIE) == (GFXTIM_IER_RFC1RIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the relative frame counter 2 reload interrupt.
  * @rmtoll
  *  IER        RFC2RIE              LL_GFXTIM_EnableIT_RFC2R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_RFC2R(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_RFC2RIE);
}

/**
  * @brief  Disable the relative frame counter 2 reload interrupt.
  * @rmtoll
  *  IER        RFC2RIE              LL_GFXTIM_DisableIT_RFC2R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_RFC2R(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_RFC2RIE);
}

/**
  * @brief  Check if the relative frame counter 2 reload interrupt is enabled.
  * @rmtoll
  *  IER        RFC2RIE              LL_GFXTIM_IsEnabledIT_RFC2R
  * @param  gfxtim GFXTIM instance.
  * @retval State of RFC2R (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_RFC2R(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_RFC2RIE) == (GFXTIM_IER_RFC2RIE)) ? 1UL : 0UL);
}

