STMicroelectronics/STM32CubeU5-V2-Preview/stm32u5xx_drivers/ll/stm32u5xx_ll_gfxtim.h
/**
  * @brief  Enable the event generator 1 interrupt.
  * @rmtoll
  *  IER        EV1IE              LL_GFXTIM_EnableIT_EV1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_EV1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_EV1IE);
}

/**
  * @brief  Disable the event generator 1 interrupt.
  * @rmtoll
  *  IER        EV1IE              LL_GFXTIM_DisableIT_EV1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_EV1(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_EV1IE);
}

/**
  * @brief  Check if the event generator 1 interrupt is enabled.
  * @rmtoll
  *  IER        EV1IE              LL_GFXTIM_IsEnabledIT_EV1
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV1 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_EV1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_EV1IE) == (GFXTIM_IER_EV1IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the event generator 2 interrupt.
  * @rmtoll
  *  IER        EV2IE              LL_GFXTIM_EnableIT_EV2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_EV2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_EV2IE);
}

/**
  * @brief  Disable the event generator 2 interrupt.
  * @rmtoll
  *  IER        EV2IE              LL_GFXTIM_DisableIT_EV2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_EV2(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_EV2IE);
}

/**
  * @brief  Check if the event generator 2 interrupt is enabled.
  * @rmtoll
  *  IER        EV2IE              LL_GFXTIM_IsEnabledIT_EV2
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV2 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_EV2(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_EV2IE) == (GFXTIM_IER_EV2IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the event generator 3 interrupt.
  * @rmtoll
  *  IER        EV3IE              LL_GFXTIM_EnableIT_EV3
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_EV3(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_EV3IE);
}

/**
  * @brief  Disable the event generator 3 interrupt.
  * @rmtoll
  *  IER        EV3IE              LL_GFXTIM_DisableIT_EV3
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_EV3(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_EV3IE);
}

/**
  * @brief  Check if the event generator 3 interrupt is enabled.
  * @rmtoll
  *  IER        EV3IE              LL_GFXTIM_IsEnabledIT_EV3
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV3 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_EV3(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_EV3IE) == (GFXTIM_IER_EV3IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the event generator 4 interrupt.
  * @rmtoll
  *  IER        EV4IE              LL_GFXTIM_EnableIT_EV4
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_EV4(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_EV4IE);
}

/**
  * @brief  Disable the event generator 3 interrupt.
  * @rmtoll
  *  IER        EV4IE              LL_GFXTIM_DisableIT_EV4
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_EV4(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_EV4IE);
}

/**
  * @brief  Check if the event generator 3 interrupt is enabled.
  * @rmtoll
  *  IER        EV4IE              LL_GFXTIM_IsEnabledIT_EV4
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV4 (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_EV4(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_EV4IE) == (GFXTIM_IER_EV4IE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the watchdog alarm interrupt.
  * @rmtoll
  *  IER        WDGAIE              LL_GFXTIM_EnableIT_WDGA
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_WDGA(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_WDGAIE);
}

/**
  * @brief  Disable the watchdog alarm interrupt.
  * @rmtoll
  *  IER        WDGAIE              LL_GFXTIM_DisableIT_WDGA
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_WDGA(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_WDGAIE);
}

/**
  * @brief  Check if the watchdog alarm interrupt is enabled.
  * @rmtoll
  *  IER        WDGAIE              LL_GFXTIM_IsEnabledIT_WDGA
  * @param  gfxtim GFXTIM instance.
  * @retval State of WDGA (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_WDGA(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_WDGAIE) == (GFXTIM_IER_WDGAIE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the watchdog pre-alarm interrupt.
  * @rmtoll
  *  IER        WDGPIE              LL_GFXTIM_EnableIT_WDGP
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_EnableIT_WDGP(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->IER, GFXTIM_IER_WDGPIE);
}

/**
  * @brief  Disable the watchdog pre-alarm interrupt.
  * @rmtoll
  *  IER        WDGPIE              LL_GFXTIM_DisableIT_WDGP
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_DisableIT_WDGP(GFXTIM_TypeDef *gfxtim)
{
  CLEAR_BIT(gfxtim->IER, GFXTIM_IER_WDGPIE);
}

/**
  * @brief  Check if the watchdog pre-alarm interrupt is enabled.
  * @rmtoll
  *  IER        WDGPIE              LL_GFXTIM_IsEnabledIT_WDGP
  * @param  gfxtim GFXTIM instance.
  * @retval State of WDGP (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsEnabledIT_WDGP(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->IER, GFXTIM_IER_WDGPIE) == (GFXTIM_IER_WDGPIE)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup LL_GFXTIM_FLAG_MANAGEMENT GFXTIM Flag management
  * @{
  */

/**
  * @brief  Clear the specified GFXTIM flag.
  * @rmtoll
  *  ICR      CAFCOF/CALCOF/CTEF/CAFCC1F/CALCC1F/CALCC2F               LL_GFXTIM_ClearFlag \n
  *  ICR      CRFC1RF/CRFC2RF/CEV1F/CEV2F/CEV3F/CEV4F/CWDGAF/CWDGPF    LL_GFXTIM_ClearFlag
  * @param  gfxtim GFXTIM instance.
  * @param  flag   This parameter can be one or a combination of the following values:
  *                @arg @ref LL_GFXTIM_FLAG_AFCO   Absolute Frame Counter Overflow Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCO   Absolute Line Counter Overflow Flag
  *                @arg @ref LL_GFXTIM_FLAG_TE     Tearing Effect Flag
  *                @arg @ref LL_GFXTIM_FLAG_AFCC1  Absolute Frame Counter Compare 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCC1  Absolute Line Counter Compare 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCC2  Absolute Line Counter Compare 2 Flag
  *                @arg @ref LL_GFXTIM_FLAG_RFC1R  Relative Frame Counter 1 Reload Flag
  *                @arg @ref LL_GFXTIM_FLAG_RFC2R  Relative Frame Counter 2 Reload Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV1    Event 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV2    Event 2 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV3    Event 3 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV4    Event 4 Flag
  *                @arg @ref LL_GFXTIM_FLAG_WDGA   Watchdog Alarm Flag
  *                @arg @ref LL_GFXTIM_FLAG_WDGP   Watchdog Pre-alarm Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALL    All Flags
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag(GFXTIM_TypeDef *gfxtim, uint32_t flag)
{
  WRITE_REG(gfxtim->ICR, flag);
}

/**
  * @brief  Check whether the specified GFXTIM flag is set or not.
  * @rmtoll
  *  ISR      AFCOF/ALCOF/TEF/AFCC1F/ALCC1F/ALCC2F               LL_GFXTIM_IsActiveFlag \n
  *  ISR      RFC1RF/RFC2RF/EV1F/EV2F/EV3F/EV4F/WDGAF/CWDGPF     LL_GFXTIM_IsActiveFlag
  * @param  gfxtim GFXTIM instance.
  * @param  flag   This parameter can be one of the following values:
  *                @arg @ref LL_GFXTIM_FLAG_AFCO   Absolute Frame Counter Overflow Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCO   Absolute Line Counter Overflow Flag
  *                @arg @ref LL_GFXTIM_FLAG_TE     Tearing Effect Flag
  *                @arg @ref LL_GFXTIM_FLAG_AFCC1  Absolute Frame Counter Compare 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCC1  Absolute Line Counter Compare 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_ALCC2  Absolute Line Counter Compare 2 Flag
  *                @arg @ref LL_GFXTIM_FLAG_RFC1R  Relative Frame Counter 1 Reload Flag
  *                @arg @ref LL_GFXTIM_FLAG_RFC2R  Relative Frame Counter 2 Reload Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV1    Event 1 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV2    Event 2 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV3    Event 3 Flag
  *                @arg @ref LL_GFXTIM_FLAG_EV4    Event 4 Flag
  *                @arg @ref LL_GFXTIM_FLAG_WDGA   Watchdog Alarm Flag
  *                @arg @ref LL_GFXTIM_FLAG_WDGP   Watchdog Pre-alarm Flag
  * @retval State of flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag(const GFXTIM_TypeDef *gfxtim, uint32_t flag)
{
  return ((READ_BIT(gfxtim->ISR, flag) == (flag)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the absolute frame counter overflow flag.
  * @rmtoll
  *  ICR      CAFCOF               LL_GFXTIM_ClearFlag_AFCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_AFCO(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CAFCOF);
}

/**
  * @brief  Check if the absolute frame counter overflow  flag is active.
  * @rmtoll
  *  ISR      AFCOF               LL_GFXTIM_IsActiveFlag_AFCO
  * @param  gfxtim GFXTIM instance.
  * @retval State of AFCO flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_AFCO(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_AFCOF) == (GFXTIM_ISR_AFCOF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the absolute line counter overflow flag.
  * @rmtoll
  *  ICR      CALCOF               LL_GFXTIM_ClearFlag_ALCO
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_ALCO(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CALCOF);
}

/**
  * @brief  Check if the absolute line counter overflow flag is active.
  * @rmtoll
  *  ISR      ALCOF               LL_GFXTIM_IsActiveFlag_ALCO
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCO flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_ALCO(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_ALCOF) == (GFXTIM_ISR_ALCOF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Tearing-effect flag.
  * @rmtoll
  *  ICR      CTEF               LL_GFXTIM_ClearFlag_TE
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_TE(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CTEF);
}

/**
  * @brief  Check if the Tearing-effect flag is active.
  * @rmtoll
  *  ISR      TEF               LL_GFXTIM_IsActiveFlag_TE
  * @param  gfxtim GFXTIM instance.
  * @retval State of TE flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_TE(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_TEF) == GFXTIM_ISR_TEF) ? 1UL : 0UL);
}

/**
  * @brief  Clear the absolute frame counter compare 1 flag.
  * @rmtoll
  *  ICR      CAFCC1F               LL_GFXTIM_ClearFlag_AFCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_AFCC1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CAFCC1F);
}

/**
  * @brief  Check if the absolute frame counter compare 1 flag is active.
  * @rmtoll
  *  ISR      AFCC1F               LL_GFXTIM_IsActiveFlag_AFCC1
  * @param  gfxtim GFXTIM instance.
  * @retval State of AFCC1 flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_AFCC1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_AFCC1F) == (GFXTIM_ISR_AFCC1F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the absolute line counter compare 1 flag.
  * @rmtoll
  *  ICR      CALCC1F               LL_GFXTIM_ClearFlag_ALCC1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_ALCC1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CALCC1F);
}

/**
  * @brief  Check if the absolute line counter compare 1 flag is active.
  * @rmtoll
  *  ISR      ALCC1F               LL_GFXTIM_IsActiveFlag_ALCC1
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCC1F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_ALCC1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_ALCC1F) == (GFXTIM_ISR_ALCC1F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the absolute line counter compare 2 flag.
  * @rmtoll
  *  ICR      CALCC2F               LL_GFXTIM_ClearFlag_ALCC2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_ALCC2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CALCC2F);
}

/**
  * @brief  Check if the absolute line counter compare 2 flag is active.
  * @rmtoll
  *  ISR      ALCC2F               LL_GFXTIM_IsActiveFlag_ALCC2
  * @param  gfxtim GFXTIM instance.
  * @retval State of ALCC2F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_ALCC2(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_ALCC2F) == (GFXTIM_ISR_ALCC2F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the relative frame counter 1 reload flag.
  * @rmtoll
  *  ICR      CRFC1RF               LL_GFXTIM_ClearFlag_RFC1R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_RFC1R(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CRFC1RF);
}

/**
  * @brief  Check if the relative frame counter 1 reload flag is active.
  * @rmtoll
  *  ISR      RFC1RF               LL_GFXTIM_IsActiveFlag_RFC1R
  * @param  gfxtim GFXTIM instance.
  * @retval State of RFC1RF flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_RFC1R(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_RFC1RF) == (GFXTIM_ISR_RFC1RF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the relative frame counter 2 reload flag.
  * @rmtoll
  *  ICR      CRFC2RF               LL_GFXTIM_ClearFlag_RFC2R
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_RFC2R(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CRFC2RF);
}

/**
  * @brief  Check if the relative frame counter 1 reload flag is active.
  * @rmtoll
  *  ISR      RFC2RF               LL_GFXTIM_IsActiveFlag_RFC2R
  * @param  gfxtim GFXTIM instance.
  * @retval State of RFC2RF flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_RFC2R(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_RFC2RF) == (GFXTIM_ISR_RFC2RF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the event generator 1 flag.
  * @rmtoll
  *  ICR      CEV1F               LL_GFXTIM_ClearFlag_EV1
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_EV1(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CEV1F);
}

/**
  * @brief  Check if the event generator 1 flag is active.
  * @rmtoll
  *  ISR      EV1F               LL_GFXTIM_IsActiveFlag_EV1
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV1F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_EV1(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_EV1F) == (GFXTIM_ISR_EV1F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the event generator 2 flag.
  * @rmtoll
  *  ICR      CEV2F               LL_GFXTIM_ClearFlag_EV2
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_EV2(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CEV2F);
}

/**
  * @brief  Check if the event generator 2 flag is active.
  * @rmtoll
  *  ISR      EV2F               LL_GFXTIM_IsActiveFlag_EV2
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV2F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_EV2(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_EV2F) == (GFXTIM_ISR_EV2F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the event generator 3 flag.
  * @rmtoll
  *  ICR      CEV3F               LL_GFXTIM_ClearFlag_EV3
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_EV3(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CEV3F);
}

/**
  * @brief  Check if the event generator 3 flag is active.
  * @rmtoll
  *  ISR      EV3F               LL_GFXTIM_IsActiveFlag_EV3
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV3F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_EV3(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_EV3F) == (GFXTIM_ISR_EV3F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the event generator 4 flag.
  * @rmtoll
  *  ICR      CEV4F               LL_GFXTIM_ClearFlag_EV4
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_EV4(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CEV4F);
}

/**
  * @brief  Check if the event generator 4 flag is active.
  * @rmtoll
  *  ISR      EV4F               LL_GFXTIM_IsActiveFlag_EV4
  * @param  gfxtim GFXTIM instance.
  * @retval State of EV4F flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_EV4(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_EV4F) == (GFXTIM_ISR_EV4F)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the watchdog alarm flag.
  * @rmtoll
  *  ICR      CWDGAF               LL_GFXTIM_ClearFlag_WDGA
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_WDGA(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CWDGAF);
}

/**
  * @brief  Check if the watchdog alarm flag is active.
  * @rmtoll
  *  ISR      WDGAF               LL_GFXTIM_IsActiveFlag_WDGA
  * @param  gfxtim GFXTIM instance.
  * @retval State of WDGAF flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_WDGA(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_WDGAF) == (GFXTIM_ISR_WDGAF)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the watchdog pre-alarm flag.
  * @rmtoll
  *  ICR      CWDGPF               LL_GFXTIM_ClearFlag_WDGP
  * @param  gfxtim GFXTIM instance.
  */
__STATIC_INLINE void LL_GFXTIM_ClearFlag_WDGP(GFXTIM_TypeDef *gfxtim)
{
  SET_BIT(gfxtim->ICR, GFXTIM_ICR_CWDGPF);
}

/**
  * @brief  Check if the watchdog pre-alarm flag is active.
  * @rmtoll
  *  ISR      WDGPF               LL_GFXTIM_IsActiveFlag_WDGP
  * @param  gfxtim GFXTIM instance.
  * @retval State of WDGPF flag (1 active / 0 not active).
  */
__STATIC_INLINE uint32_t LL_GFXTIM_IsActiveFlag_WDGP(const GFXTIM_TypeDef *gfxtim)
{
  return ((READ_BIT(gfxtim->ISR, GFXTIM_ISR_WDGPF) == (GFXTIM_ISR_WDGPF)) ? 1UL : 0UL);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (GFXTIM) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32U5XX_LL_GFXTIM_H */
